xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
* THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
* Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
************************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : rm_touch_qe.c
* Description  : This module implements the QE TOUCH API
***********************************************************************************************************************/

/***********************************************************************************************************************
 * Includes
 **********************************************************************************************************************/
#ifdef QE_TOUCH_CONFIGURATION
 #include "qe_touch_define.h"
#endif
#include "rm_touch_qe_if.h"
#include "r_ctsu_qe_api.h"
#include "r_ctsu_qe_config.h"
#if ((TOUCH_CFG_UART_MONITOR_SUPPORT == 1) || (TOUCH_CFG_UART_TUNING_SUPPORT == 1))
#include "r_sci_rx_if.h"
#endif

/***********************************************************************************************************************
 * Macro definitions
 **********************************************************************************************************************/
#ifndef TOUCH_ERROR_RETURN

 #define TOUCH_ERROR_RETURN(a, err)    FSP_ERROR_RETURN((a), (err))
#endif

/** "TOUC" in ASCII, used to determine if device is open. */
#define TOUCH_OPEN                            (0x544F5543ULL)

#define TOUCH_SLIDER_ELEMENTS_MIN             (3)
#define TOUCH_SLIDER_ELEMENTS_MAX             (10)
#define TOUCH_WHEEL_ELEMENTS_SMALL            (4)
#define TOUCH_WHEEL_ELEMENTS_LARGE            (8)
#define TOUCH_SLIDER_RESOLUTION               (100)
#define TOUCH_WHEEL_RESOLUTION                (360)
#define TOUCH_DECIMAL_POINT_PRECISION         (100)

#if TOUCH_CFG_MONITOR_ENABLE
 #define TOUCH_MONITOR_BLOCK_MAX              (8)
 #define TOUCH_MONITOR_HEADER_SIZE            (4)
 #define TOUCH_MONITOR_SELF_ELEMENT_SIZE      (2)
 #define TOUCH_MONITOR_MUTUAL_ELEMENT_SIZE    (4)
 #if (TOUCH_CFG_NUM_BUTTONS != 0)
  #define TOUCH_MONITOR_BHEAD_SIZE            (2)
 #else
  #define TOUCH_MONITOR_BHEAD_SIZE            (0)
 #endif
 #if (TOUCH_CFG_NUM_SLIDERS != 0)
  #define TOUCH_MONITOR_SHEAD_SIZE            (2)
 #else
  #define TOUCH_MONITOR_SHEAD_SIZE            (0)
 #endif
 #if (TOUCH_CFG_NUM_WHEELS != 0)
  #define TOUCH_MONITOR_WHEAD_SIZE            (2)
 #else
  #define TOUCH_MONITOR_WHEAD_SIZE            (0)
 #endif
 #define TOUCH_MONITOR_BUTTON_SIZE            (7)
 #define TOUCH_MONITOR_SLIDER_SIZE            (4)
 #define TOUCH_MONITOR_WHEEL_SIZE             (4)
 #if (TOUCH_CFG_PAD_ENABLE)
  #define TOUCH_MONITOR_PAD_ELEMENT_SIZE      (2)
  #define TOUCH_MONITOR_PAD_COORD_SIZE        (40)
  #define TOUCH_MONITOR_PAD_SIZE              (11)
  #define TOUCH_MONITOR_PAD_TOTAL_SIZE        (TOUCH_MONITOR_PAD_COORD_SIZE + TOUCH_MONITOR_PAD_SIZE)
 #else
  #define TOUCH_MONITOR_PAD_TOTAL_SIZE        (0)
 #endif
 #define TOUCH_MONITOR_FOOTER_SIZE            (1)
 #define TOUCH_MONITOR_BUFFER_SIZE            ((TOUCH_MONITOR_HEADER_SIZE * TOUCH_MONITOR_BLOCK_MAX) +              \
                                               (TOUCH_MONITOR_SELF_ELEMENT_SIZE * CTSU_CFG_NUM_SELF_ELEMENTS) +     \
                                               (TOUCH_MONITOR_MUTUAL_ELEMENT_SIZE * CTSU_CFG_NUM_MUTUAL_ELEMENTS) + \
                                               (TOUCH_MONITOR_BHEAD_SIZE * TOUCH_MONITOR_BLOCK_MAX) +               \
                                               (TOUCH_MONITOR_BUTTON_SIZE * TOUCH_CFG_NUM_BUTTONS) +                \
                                               (TOUCH_MONITOR_SHEAD_SIZE * TOUCH_MONITOR_BLOCK_MAX) +               \
                                               (TOUCH_MONITOR_SLIDER_SIZE * TOUCH_CFG_NUM_SLIDERS) +                \
                                               (TOUCH_MONITOR_WHEAD_SIZE * TOUCH_MONITOR_BLOCK_MAX) +               \
                                               (TOUCH_MONITOR_WHEEL_SIZE * TOUCH_CFG_NUM_WHEELS) +                  \
                                               (TOUCH_MONITOR_PAD_TOTAL_SIZE) +                                     \
                                               TOUCH_MONITOR_FOOTER_SIZE * TOUCH_MONITOR_BLOCK_MAX)

 #if (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)

/* Monitor none value */
  #define TOUCH_UART_MONITOR_NONE             (0xFF)

/* Control byte */
  #define TOUCH_UART_HEADER                   (0x55)
  #define TOUCH_UART_FOOTER                   (0x0A)

/* Command ID */
  #define TOUCH_UART_COMMAND_START            (0x11)
  #define TOUCH_UART_COMMAND_STOP             (0x12)
  #define TOUCH_UART_COMMAND_READ             (0x13)
  #define TOUCH_UART_COMMAND_WRITE            (0x14)
  #define TOUCH_UART_COMMAND_VERSION          (0x15)

  #define TOUCH_UART_COMMAND_TOP_NUM          (0x1)

