xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
/* Response ID */
  #define TOUCH_UART_RESPONSE_BIT             (0x80)
  #define TOUCH_UART_RESPONSE_ERROR_BIT       (0xA0)
  #define TOUCH_UART_RESPONSE_MONITOR         (0xA1)
  #define TOUCH_UART_RESPONSE_MONITOR2        (0xA2)

/* Write Request Type */
  #define TOUCH_UART_WRITE_DRIFT              (0x01)
  #define TOUCH_UART_WRITE_CANCEL             (0x02)
  #define TOUCH_UART_WRITE_POSITIVE           (0x03)
  #define TOUCH_UART_WRITE_NEGATIVE           (0x04)
  #define TOUCH_UART_WRITE_MOVING_AVG         (0x05)
  #define TOUCH_UART_WRITE_THRESHOLD          (0x06)
  #define TOUCH_UART_WRITE_HYSTERESIS         (0x07)
  #define TOUCH_UART_WRITE_THRESH_SLDR        (0x08)
  #define TOUCH_UART_WRITE_THRESH_WHEL        (0x09)
  #define TOUCH_UART_WRITE_CTSUSO             (0x0A)
  #define TOUCH_UART_WRITE_CTSUSNUM           (0x0B)
  #define TOUCH_UART_WRITE_CTSUSDPA           (0x0C)
  #define TOUCH_UART_WRTIE_PAD_THRESHOLD      (0x0D)
  #define TOUCH_UART_WRTIE_PAD_RX_PIXEL       (0x0E)
  #define TOUCH_UART_WRTIE_PAD_TX_PIXEL       (0x0F)
  #define TOUCH_UART_WRTIE_PAD_MAX_TOUCH      (0x10)
  #define TOUCH_UART_WRTIE_PAD_DRIFT          (0x11)

/* Method Number Maximum */
  #define TOUCH_UART_INSTANCE_MAX             (32)

/* UART Receive Buffer Size */
  #define TOUCH_UART_RECIEVE_BUF_SIZE         (13)

/* UART Command version */
  #define TOUCH_UART_VERSION_MAJOR            ((uint8_t) 0x01U)
  #define TOUCH_UART_VERSION_MINOR            ((uint8_t) 0x00U)

 #endif

/* Method Number Maximum */
 #define TOUCH_UART_INSTANCE_MAX              (32)
#endif
#if (TOUCH_CFG_PAD_ENABLE)
 #define TOUCH_MAP_X                          (3)
 #define TOUCH_MAP_Y                          (3)
 #define TOUCH_PAD_TEMP_VALUE_OVERFLOW_BIT    (0x8000)
 #define TOUCH_PAD_MONITOR_TOUCH_NUM_MAX      (10)
#endif

#define TOUCH_RATIO_CALC(a)    ((uint16_t) (a / 100))

#if (TOUCH_CFG_UART_TUNING_SUPPORT == 1)
 #define TOUCH_TUNING_CH_REG_MAX_NUM                   (32)
 #define TOUCH_TUNING_KEY_MAX_NUM                      (CTSU_CFG_NUM_SELF_ELEMENTS + CTSU_CFG_NUM_MUTUAL_ELEMENTS * 2)

 #define TOUCH_UART_TSCHAC_MASK                        (0xFF)
 #define TOUCH_UART_TSCHTRC_MASK                       (0xFF)
 #if (BSP_FEATURE_CTSU_VERSION == 1)
  #define TOUCH_TUNING_PCLKB_FREQ_MHZ                  (1000000)
  #define TOUCH_TUNING_PCLKB_FREQ_32MHZ                (32000000)
  #define TOUCH_TUNING_PCLKB_FREQ_64MHZ                (64000000)
 #endif

/* UART Receive Buffer Size */
 #define TOUCH_TUNING_TRANSMIT_BUF_SIZE                (0xC)

/* Control byte */
 #define TOUCH_TUNING_HEADER                           (0x55)
 #define TOUCH_TUNING_FOOTER                           (0x0A)

/* Command ID */
 #define TOUCH_TUNING_COMMAND_START                    (0x21)
 #define TOUCH_TUNING_COMMAND_STOP                     (0x22)
 #define TOUCH_TUNING_COMMAND_VARIABLE_WRITE           (0x23)
 #define TOUCH_TUNING_COMMAND_VARIABLE_READ            (0x24)
 #define TOUCH_TUNING_COMMAND_ADDRESS_WRITE            (0x25)
 #define TOUCH_TUNING_COMMAND_ADDRESS_READ             (0x26)
 #define TOUCH_TUNING_COMMAND_PHASE_RUN                (0x27)
 #define TOUCH_TUNING_COMMAND_VERSION                  (0x28)

 #define TOUCH_TUNING_COMMAND_TOP_NUM                  (0x2)

/* Response ID */
 #define TOUCH_TUNING_RESPONSE_BIT                     (0x60)
 #define TOUCH_TUNING_RESPONSE_ERROR_BIT               (0xA0)

/*variable command ID */
 #define TOUCH_TUNING_VARIABLE_MCU_GROUP               (0x1)
 #define TOUCH_TUNING_VARIABLE_PCLKB_FREQUENCY         (0x2)
 #define TOUCH_TUNING_VARIABLE_TUNING_MODE             (0x3)
 #define TOUCH_TUNING_VARIABLE_CTSU_STATE              (0x4)
 #define TOUCH_TUNING_VARIABLE_CTSU_SCAN_MODE          (0x5)
 #define TOUCH_TUNING_VARIABLE_TS_CHAC_MASK_BOTTOM     (0x6)
 #define TOUCH_TUNING_VARIABLE_TS_CHAC_MASK_TOP        (0x7)
 #define TOUCH_TUNING_VARIABLE_TS_CHTRC_MASK_BOTTOM    (0x8)
 #define TOUCH_TUNING_VARIABLE_TS_CHTRC_MASK_TOP       (0x9)
 #define TOUCH_TUNING_VARIABLE_QE_TXVSEL               (0xA)
 #define TOUCH_TUNING_VARIABLE_QE_ATUNE                (0xB)
 #define TOUCH_TUNING_VARIABLE_QE_POSEL                (0xC)
 #define TOUCH_TUNING_VARIABLE_ERR_EVENT               (0xD)
 #define TOUCH_TUNING_VARIABLE_CTSU_ICO_DATA_PRI       (0xE)
 #define TOUCH_TUNING_VARIABLE_CTSU_ICO_DATA_SND       (0xF)
 #define TOUCH_TUNING_VARIABLE_CTSU_MUTUAL_DATA        (0x10)
 #define TOUCH_TUNING_VARIABLE_ELEMENT_CFGS_SO         (0x11)
 #define TOUCH_TUNING_VARIABLE_ELEMENT_CFGS_SNUM       (0x12)
 #define TOUCH_TUNING_VARIABLE_ELEMENT_CFGS_SDPA       (0x13)
 #if (BSP_FEATURE_CTSU_VERSION == 1)
  #define TOUCH_TUNING_VARIABLE_CTSU_WRITE_SSC         (0x14)
  #define TOUCH_TUNING_VARIABLE_CTSU_WRITE_SO0         (0x15)
  #define TOUCH_TUNING_VARIABLE_CTSU_WRITE_SO1         (0x16)
 #endif
 #define TOUCH_TUNING_VARIABLE_SELF_TARGET_VALUE       (0x17)
 #define TOUCH_TUNING_VARIABLE_MUTUAL_TARGET_VALUE     (0x18)
 #if (BSP_FEATURE_CTSU_VERSION == 2)
  #if (CTSU_CFG_MULTIPLE_ELECTRODE_CONNECTION_ENABLE == 1)
 #define TOUCH_TUNING_VARIABLE_QE_TSOD                 (0x19)
 #define TOUCH_TUNING_VARIABLE_QE_MEC_TS               (0x1A)
 #define TOUCH_TUNING_VARIABLE_QE_MEC_SHIELD_TS        (0x1B)
  #endif
 #endif
#endif

#if ((TOUCH_CFG_MONITOR_ENABLE && (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)) || (TOUCH_CFG_UART_TUNING_SUPPORT == 1))

/* Register mask and bit-shift */
 #if (BSP_FEATURE_CTSU_VERSION == 2)
  #define TOUCH_UART_CTSUSO_MASK          (0x3FF)
  #define TOUCH_UART_CTSUSNUM_MASK        (0xFF)
  #define TOUCH_UART_CTSUSDPA_MASK        (0xFF)
  #define TOUCH_UART_CTSUSNUM_SHIFT       (10)
  #define TOUCH_UART_CTSUSDPA_SHIFT       (24)
 #endif
 #if (BSP_FEATURE_CTSU_VERSION == 1)
  #define TOUCH_UART_CTSUSO_MASK          (0x3FF)
  #define TOUCH_UART_CTSUSNUM_MASK        (0x3F)
  #define TOUCH_UART_CTSUSDPA_MASK        (0x1F)
  #define TOUCH_UART_CTSUSNUM_SHIFT       (10)
  #define TOUCH_UART_CTSUSDPA_SHIFT       (8)
 #endif

 #define TOUCH_TUNING_COMMAND_BUF_NUM     (0x2)
 #define TOUCH_TUNING_RECIEVE_BUF_SIZE    (0xF)
 #define TOUCH_TUNING_ICOG_100            (0)                     // ICOG = 100%
 #define TOUCH_TUNING_ICOG_66             (1)                     // ICOG = 66%
 #define TOUCH_TUNING_RICOA_RECOMMEND     (0xFF)                  // ICO input current
 #if (CTSU_CFG_MCU_PROCESS_MF3 == 1)
  #define TOUCH_TUNING_ICOG_RECOMMEND     (TOUCH_TUNING_ICOG_66)  // Recommended setting value
 #endif
 #if (CTSU_CFG_MCU_PROCESS_40N_PHASE2 == 1)
  #define TOUCH_TUNING_ICOG_RECOMMEND     (TOUCH_TUNING_ICOG_100) // Recommended setting value
 #endif

#endif

#if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
 #define TOUCH_MUTUAL_SECONDARY_MAX     (45000)             // Mutual Secondary count MAX
 #define TOUCH_MUTUAL_INT16_MAX         (32767)             // int16 Max Value
#endif

