xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
/***********************************************************************************************************************
 * Typedef definitions
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Private function prototypes
 **********************************************************************************************************************/
#if (TOUCH_CFG_NUM_BUTTONS != 0)
 #if (CTSU_CFG_NUM_SELF_ELEMENTS != 0)
static void touch_button_self_decode(touch_button_info_t * p_binfo, uint16_t value, uint8_t button_id);
static void touch_button_drift(touch_button_info_t * p_binfo, uint16_t value, uint8_t button_id);
 #endif
 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
static void touch_button_mutual_decode(touch_button_info_t * p_binfo, int16_t value, uint8_t button_id);
static void touch_button_mutual_drift(touch_button_info_t * p_binfo, int16_t value, uint8_t button_id);
 #endif
static void touch_button_on(touch_button_info_t * p_binfo, uint16_t value, uint8_t button_id);
static void touch_button_off(touch_button_info_t * p_binfo, uint8_t button_id);

#endif
#if (TOUCH_CFG_NUM_SLIDERS != 0)
static void touch_slider_decode(touch_slider_info_t * p_sinfo,
                                uint16_t            * slider_data,
                                uint8_t               num_elements,
                                uint8_t               slider_id);

#endif
#if (TOUCH_CFG_NUM_WHEELS != 0)
static void touch_wheel_decode(touch_wheel_info_t * p_winfo,
                               uint16_t           * wheel_data,
                               uint8_t              num_elements,
                               uint8_t              wheel_id);

#endif

#if (TOUCH_CFG_PAD_ENABLE)
static void touch_pad_decode(touch_pad_info_t * p_pinfo, uint8_t num_x, uint8_t num_y, uint8_t max_touch);

#endif

#if ((TOUCH_CFG_MONITOR_ENABLE && (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)) || (TOUCH_CFG_UART_TUNING_SUPPORT == 1))
void touch_uart_callback(void *pargs);

#endif

#if (TOUCH_CFG_UART_TUNING_SUPPORT == 1)
void touch_serial_tuning(touch_instance_ctrl_t * const p_instance_ctrl);

void touch_tuning_uart_connect(void);

void touch_tuning_initialize(touch_instance_ctrl_t * const p_instance_ctrl);
void touch_tuning_scan_mode_select(touch_instance_ctrl_t * const p_instance_ctrl);
void touch_tuning_scan_register_setting(touch_instance_ctrl_t * const p_instance_ctrl);
void touch_tuning_ts_setup(touch_instance_ctrl_t * const p_instance_ctrl);
void touch_tuning_count_element(uint32_t element_mask, uint16_t * num_element);
void touch_tuning_qe_get_cfg(touch_instance_ctrl_t * const p_instance_ctrl);
void touch_tuning_qe_get_value(touch_instance_ctrl_t * const p_instance_ctrl);

void touch_tuning_open(touch_instance_ctrl_t * const p_instance_ctrl);
void touch_tuning_dataget(touch_instance_ctrl_t * const p_instance_ctrl);
void touch_tuning_scanstart(touch_instance_ctrl_t * const p_instance_ctrl);

void touch_tuning_get32(uint32_t * p_val, uint16_t index);
void touch_tuning_get16(uint16_t * p_val, uint16_t index);
void touch_tuning_get8(uint8_t * p_val, uint16_t index);

void touch_tuning_send32(uint32_t value, uint16_t index);
void touch_tuning_send16(uint16_t value, uint16_t index);
void touch_tuning_send8(uint8_t value, uint16_t index);

 #if (BSP_FEATURE_CTSU_VERSION == 1)
void touch_tuning_pclkb_get(volatile uint32_t * pclkb_frequency);

 #endif

/* Reconnection due to UART baud rate difference. */
void touch_tuning_baudrate_err_reconnect(void);

#endif

/***********************************************************************************************************************
 * Private global variables
 **********************************************************************************************************************/

#if (TOUCH_CFG_NUM_BUTTONS != 0)
static uint8_t  g_touch_button_index = 0;
static uint16_t g_touch_button_threshold[TOUCH_CFG_NUM_BUTTONS];
static uint16_t g_touch_button_hysteresis[TOUCH_CFG_NUM_BUTTONS];
static uint16_t g_touch_button_reference[TOUCH_CFG_NUM_BUTTONS];
static uint16_t g_touch_button_on_count[TOUCH_CFG_NUM_BUTTONS];
static uint16_t g_touch_button_off_count[TOUCH_CFG_NUM_BUTTONS];
static uint32_t g_touch_button_drift_buf[TOUCH_CFG_NUM_BUTTONS];
static uint16_t g_touch_button_drift_count[TOUCH_CFG_NUM_BUTTONS];
#endif
#if (TOUCH_CFG_NUM_SLIDERS != 0)
static uint8_t  g_touch_slider_index = 0;
static uint16_t g_touch_slider_position[TOUCH_CFG_NUM_SLIDERS];
static uint16_t g_touch_slider_threshold[TOUCH_CFG_NUM_SLIDERS];
#endif
#if (TOUCH_CFG_NUM_WHEELS != 0)
static uint8_t  g_touch_wheel_index = 0;
static uint16_t g_touch_wheel_position[TOUCH_CFG_NUM_WHEELS];
static uint16_t g_touch_wheel_threshold[TOUCH_CFG_NUM_WHEELS];
#endif
#if (TOUCH_CFG_PAD_ENABLE)
static uint16_t g_touch_pad_rx_coordinate[TOUCH_PAD_MONITOR_TOUCH_NUM_MAX];
static uint16_t g_touch_pad_tx_coordinate[TOUCH_PAD_MONITOR_TOUCH_NUM_MAX];
static uint16_t g_touch_pad_num_touch;
static uint16_t g_touch_pad_threshold;
static uint16_t g_touch_pad_rx_pixsel;
static uint16_t g_touch_pad_tx_pixsel;
static uint8_t  g_touch_pad_max_touch;
static uint16_t g_touch_pad_drift_count;
static int32_t  g_touch_pad_drift_buf[CTSU_CFG_NUM_CFC * CTSU_CFG_NUM_CFC_TX];
static uint16_t g_touch_pad_base[CTSU_CFG_NUM_CFC * CTSU_CFG_NUM_CFC_TX];
static int16_t  g_touch_pad_buf[CTSU_CFG_NUM_CFC * CTSU_CFG_NUM_CFC_TX * 2];
static uint8_t  g_touch_base_set_falg = 0;
#endif
#if TOUCH_CFG_MONITOR_ENABLE
 #if ((TOUCH_CFG_UART_MONITOR_SUPPORT == 1) || (TOUCH_CFG_UART_TUNING_SUPPORT == 1))
static uint8_t g_touch_monitor_buf[TOUCH_MONITOR_BUFFER_SIZE];
 #else
static volatile uint8_t g_touch_monitor_buf[TOUCH_MONITOR_BUFFER_SIZE];
 #endif
static uint8_t  g_touch_monitor_id;
static uint16_t g_touch_monitor_size[TOUCH_MONITOR_BLOCK_MAX];
 #if (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)
static touch_instance_ctrl_t * gp_touch_ctrl_list[TOUCH_UART_INSTANCE_MAX];

/* Detect method number */
static uint32_t g_touch_uart_open_bitmap;

/* Monitoring method number */
static uint8_t g_touch_uart_monitor_num;
 #endif
#endif

#if (TOUCH_CFG_UART_TUNING_SUPPORT == 1)

/* QE send Data */
static volatile uint32_t             g_touch_tuning_pclkb_frequency;
static volatile uint8_t              g_touch_tuning_mcu_group;
static volatile touch_tuning_state_t g_touch_tuning_state;
static volatile touch_tuning_mode_t  g_touch_tuning_mode;
static volatile touch_tuning_scan_t  g_touch_tuning_scan_mode;
static touch_tuning_ts_msk_t         g_touch_tuning_ts_chac_mask;
static touch_tuning_ts_msk_t         g_touch_tuning_ts_chtrc_mask;
static volatile ctsu_event_t         g_touch_tuning_err_event;
 #if (BSP_FEATURE_CTSU_VERSION == 2)
static volatile ctsu_atune12_t g_touch_tuning_qe_atune;
 #endif
 #if (BSP_FEATURE_CTSU_VERSION == 1)
static volatile ctsu_atune1_t g_touch_tuning_qe_atune;
 #endif
static volatile ctsu_posel_t g_touch_tuning_qe_posel;
static volatile uint8_t      g_touch_tuning_qe_txvsel;
static volatile uint8_t      g_touch_tuning_phase_run;
static uint16_t              g_touch_tuning_self_target_value;
static uint16_t              g_touch_tuning_mutual_target_value;
 #if (BSP_FEATURE_CTSU_VERSION == 2)
  #if (CTSU_CFG_MULTIPLE_ELECTRODE_CONNECTION_ENABLE == 1)
static volatile uint8_t      g_touch_tuning_qe_tsod;
static volatile uint8_t      g_touch_tuning_qe_mec_ts;
static volatile uint8_t      g_touch_tuning_qe_mec_shield_ts;
  #endif
 #endif

static volatile touch_tuning_mode_t g_touch_tuning_mode_save;

/* interrupt datas (QE get this data) */
static uint16_t g_touch_tuning_ico_data[TOUCH_TUNING_KEY_MAX_NUM];
 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
static uint16_t g_touch_tuning_mutual_data[CTSU_CFG_NUM_MUTUAL_ELEMENTS];
 #endif
 #if (BSP_FEATURE_CTSU_VERSION == 2)
static ctsu_element_cfg_t g_touch_tuning_element_cfgs[TOUCH_TUNING_KEY_MAX_NUM];
 #endif
 #if (BSP_FEATURE_CTSU_VERSION == 1)
static ctsu_ctsuwr_t g_touch_tuning_ctsu_write[TOUCH_TUNING_KEY_MAX_NUM];
 #endif
static ctsu_md_t g_touch_tuning_md;

static uint8_t g_touch_tuning_tx_buf[TOUCH_TUNING_TRANSMIT_BUF_SIZE];
#endif

