xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
#if ((TOUCH_CFG_MONITOR_ENABLE && (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)) || (TOUCH_CFG_UART_TUNING_SUPPORT == 1))

/* data transmit flag */
volatile uint8_t g_touch_uart_transmit_flag;
volatile uint8_t g_touch_uart_command_top;

static uint8_t           g_touch_uart_rx_buf[TOUCH_TUNING_RECIEVE_BUF_SIZE];

    /* UART receive interrupt count number */
    volatile uint8_t   g_receive_intterupt_count = 0;
    static   sci_cfg_t g_touch_uart_config;
    static   sci_hdl_t g_touch_uart_control;

    /* Reconnection due to UART baud rate difference. */
    static   uint8_t   g_touch_uart_baudrate_err_flag = 0;
#endif

/***********************************************************************************************************************
 * Global variables
 **********************************************************************************************************************/
const touch_api_t g_touch_on_ctsu =
{
    .open                = RM_TOUCH_Open,
    .scanStart           = RM_TOUCH_ScanStart,
    .dataGet             = RM_TOUCH_DataGet,
    .padDataGet          = RM_TOUCH_PadDataGet,
    .callbackSet         = RM_TOUCH_CallbackSet,
    .scanStop            = RM_TOUCH_ScanStop,
    .close               = RM_TOUCH_Close,
    .sensitivityRatioGet = RM_TOUCH_SensitivityRatioGet,
    .thresholdAdjust     = RM_TOUCH_ThresholdAdjust,
    .driftControl        = RM_TOUCH_DriftControl,
    .monitorAddressGet   = RM_TOUCH_MonitorAddressGet,
};

touch_instance_ctrl_t * gp_touch_isr_context;

/*******************************************************************************************************************//**
 * @addtogroup TOUCH
 * @{
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Functions
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * @brief Opens and configures the TOUCH Middle module. Implements @ref touch_api_t::open.
 *
 * Example:
 * @snippet rm_touch_example.c RM_TOUCH_Open
 *
 * @retval FSP_SUCCESS              TOUCH successfully configured.
 * @retval FSP_ERR_ASSERTION        Null pointer, or one or more configuration options is invalid.
 * @retval FSP_ERR_ALREADY_OPEN     Module is already open.  This module can only be opened once.
 * @retval FSP_ERR_INVALID_ARGUMENT Configuration parameter error.
 **********************************************************************************************************************/
fsp_err_t RM_TOUCH_Open (touch_ctrl_t * const p_ctrl, touch_cfg_t const * const p_cfg)
{
    touch_instance_ctrl_t * p_instance_ctrl = (touch_instance_ctrl_t *) p_ctrl;
#if ((TOUCH_CFG_NUM_BUTTONS != 0) || (TOUCH_CFG_NUM_SLIDERS != 0) || (TOUCH_CFG_NUM_WHEELS != 0) || \
    (TOUCH_CFG_PAD_ENABLE))
    uint8_t id;
#endif
    fsp_err_t err = FSP_SUCCESS;
#if TOUCH_CFG_MONITOR_ENABLE
    uint8_t num;
#endif

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
    FSP_ASSERT(p_cfg);
#endif
    TOUCH_ERROR_RETURN(TOUCH_OPEN != p_instance_ctrl->open, FSP_ERR_ALREADY_OPEN);

    p_instance_ctrl->p_touch_cfg = p_cfg;

    /** Parameter Setting */
#if (TOUCH_CFG_NUM_BUTTONS != 0)
    if (NULL != p_cfg->p_buttons)
    {
        if (TOUCH_CFG_NUM_BUTTONS >= g_touch_button_index)
        {
            p_instance_ctrl->binfo.p_reference   = &g_touch_button_reference[g_touch_button_index];
            p_instance_ctrl->binfo.p_on_count    = &g_touch_button_on_count[g_touch_button_index];
            p_instance_ctrl->binfo.p_off_count   = &g_touch_button_off_count[g_touch_button_index];
            p_instance_ctrl->binfo.p_drift_buf   = &g_touch_button_drift_buf[g_touch_button_index];
            p_instance_ctrl->binfo.p_drift_count = &g_touch_button_drift_count[g_touch_button_index];
            p_instance_ctrl->binfo.p_threshold   = &g_touch_button_threshold[g_touch_button_index];
            p_instance_ctrl->binfo.p_hysteresis  = &g_touch_button_hysteresis[g_touch_button_index];
            g_touch_button_index                 =
                (uint8_t) (g_touch_button_index + p_instance_ctrl->p_touch_cfg->num_buttons);
        }

        if (0 == p_cfg->on_freq)
        {
            err = FSP_ERR_INVALID_ARGUMENT;
        }

        if (0 == p_cfg->off_freq)
        {
            err = FSP_ERR_INVALID_ARGUMENT;
        }

        if (0 != p_cfg->cancel_freq)
        {
            if (p_cfg->cancel_freq < p_cfg->on_freq)
            {
                err = FSP_ERR_INVALID_ARGUMENT;
            }
        }

        p_instance_ctrl->binfo.on_freq     = p_cfg->on_freq;
        p_instance_ctrl->binfo.off_freq    = p_cfg->off_freq;
        p_instance_ctrl->binfo.drift_freq  = p_cfg->drift_freq;
        p_instance_ctrl->binfo.cancel_freq = p_cfg->cancel_freq;

        for (id = 0; id < p_cfg->num_buttons; id++)
        {
            if (p_cfg->p_buttons[id].threshold < p_cfg->p_buttons[id].hysteresis)
            {
                err = FSP_ERR_INVALID_ARGUMENT;
            }

            *(p_instance_ctrl->binfo.p_reference + id)   = 0;
            *(p_instance_ctrl->binfo.p_on_count + id)    = 0;
            *(p_instance_ctrl->binfo.p_off_count + id)   = 0;
            *(p_instance_ctrl->binfo.p_drift_buf + id)   = 0;
            *(p_instance_ctrl->binfo.p_drift_count + id) = 0;
            *(p_instance_ctrl->binfo.p_threshold + id)   = p_cfg->p_buttons[id].threshold;
            *(p_instance_ctrl->binfo.p_hysteresis + id)  = p_cfg->p_buttons[id].hysteresis;
        }
    }
#endif
#if (TOUCH_CFG_NUM_SLIDERS != 0)
    if (NULL != p_cfg->p_sliders)
    {
        if (TOUCH_CFG_NUM_SLIDERS >= g_touch_slider_index)
        {
            p_instance_ctrl->sinfo.p_position  = &g_touch_slider_position[g_touch_slider_index];
            p_instance_ctrl->sinfo.p_threshold = &g_touch_slider_threshold[g_touch_slider_index];
            g_touch_slider_index               = (uint8_t) (g_touch_slider_index + p_cfg->num_sliders);
        }

        for (id = 0; id < p_cfg->num_sliders; id++)
        {
            if ((TOUCH_SLIDER_ELEMENTS_MIN > p_cfg->p_sliders[id].num_elements) ||
                (TOUCH_SLIDER_ELEMENTS_MAX < p_cfg->p_sliders[id].num_elements))
            {
                err = FSP_ERR_INVALID_ARGUMENT;
            }

            *(p_instance_ctrl->sinfo.p_threshold + id) = p_cfg->p_sliders[id].threshold;
        }
    }
#endif
#if (TOUCH_CFG_NUM_WHEELS != 0)
    if (NULL != p_cfg->p_wheels)
    {
        if (TOUCH_CFG_NUM_WHEELS >= g_touch_wheel_index)
        {
            p_instance_ctrl->winfo.p_position  = &g_touch_wheel_position[g_touch_wheel_index];
            p_instance_ctrl->winfo.p_threshold = &g_touch_wheel_threshold[g_touch_wheel_index];
            g_touch_wheel_index                = (uint8_t) (g_touch_wheel_index + p_cfg->num_wheels);
        }

        for (id = 0; id < p_cfg->num_wheels; id++)
        {
            if ((TOUCH_WHEEL_ELEMENTS_LARGE != p_cfg->p_wheels[id].num_elements) &&
                (TOUCH_WHEEL_ELEMENTS_SMALL != p_cfg->p_wheels[id].num_elements))
            {
                err = FSP_ERR_INVALID_ARGUMENT;
            }

            *(p_instance_ctrl->winfo.p_threshold + id) = p_cfg->p_wheels[id].threshold;
        }
    }
#endif
#if (TOUCH_CFG_PAD_ENABLE)
    if (NULL != p_cfg->p_pad)
    {
        p_instance_ctrl->pinfo.p_rx_coordinate = &g_touch_pad_rx_coordinate[0];
        p_instance_ctrl->pinfo.p_tx_coordinate = &g_touch_pad_tx_coordinate[0];
        p_instance_ctrl->pinfo.p_num_touch     = &g_touch_pad_num_touch;
        p_instance_ctrl->pinfo.p_threshold     = &g_touch_pad_threshold;
        p_instance_ctrl->pinfo.p_rx_pixel      = &g_touch_pad_rx_pixsel;
        p_instance_ctrl->pinfo.p_tx_pixel      = &g_touch_pad_tx_pixsel;
        p_instance_ctrl->pinfo.p_max_touch     = &g_touch_pad_max_touch;
        p_instance_ctrl->pinfo.p_drift_buf     = &g_touch_pad_drift_buf[0];
        p_instance_ctrl->pinfo.p_drift_count   = &g_touch_pad_drift_count;
        p_instance_ctrl->pinfo.p_base_buf      = &g_touch_pad_base[0];

        *(p_instance_ctrl->pinfo.p_threshold) = p_cfg->p_pad->threshold;
        *(p_instance_ctrl->pinfo.p_rx_pixel)  = p_cfg->p_pad->rx_pixel;
        *(p_instance_ctrl->pinfo.p_tx_pixel)  = p_cfg->p_pad->tx_pixel;
        *(p_instance_ctrl->pinfo.p_max_touch) = p_cfg->p_pad->max_touch;
        p_instance_ctrl->pinfo.num_drift      = p_cfg->p_pad->num_drift;

        for (id = 0; id < (CTSU_CFG_NUM_CFC * CTSU_CFG_NUM_CFC_TX); id++)
        {
            *(p_instance_ctrl->pinfo.p_drift_buf + id) = 0;
        }

        *(p_instance_ctrl->pinfo.p_drift_count) = 0;
    }
#endif

    if (FSP_SUCCESS == err)
    {
        p_instance_ctrl->p_ctsu_instance = p_cfg->p_ctsu_instance;
        err = p_instance_ctrl->p_ctsu_instance->p_api->open(p_cfg->p_ctsu_instance->p_ctrl,
                                                            p_cfg->p_ctsu_instance->p_cfg);
    }

#if TOUCH_CFG_MONITOR_ENABLE
    num = p_cfg->number;
    g_touch_monitor_size[num] = (uint16_t) (TOUCH_MONITOR_SELF_ELEMENT_SIZE * p_cfg->p_ctsu_instance->p_cfg->num_rx);

 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
    if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->p_ctsu_instance->p_cfg->md))
    {
        g_touch_monitor_size[num] =
            (uint16_t) (TOUCH_MONITOR_MUTUAL_ELEMENT_SIZE *
                        p_cfg->p_ctsu_instance->p_cfg->num_rx * p_cfg->p_ctsu_instance->p_cfg->num_tx);
    }
 #endif
 #if (TOUCH_CFG_NUM_BUTTONS != 0)
    if (NULL != p_cfg->p_buttons)
    {
        g_touch_monitor_size[num] =
            (uint16_t) (g_touch_monitor_size[num] + TOUCH_MONITOR_BHEAD_SIZE +
                        (TOUCH_MONITOR_BUTTON_SIZE * p_cfg->num_buttons));
    }
 #endif
 #if (TOUCH_CFG_NUM_SLIDERS != 0)
    if (NULL != p_cfg->p_sliders)
    {
        g_touch_monitor_size[num] =
            (uint16_t) (g_touch_monitor_size[num] + TOUCH_MONITOR_SHEAD_SIZE +
                        (TOUCH_MONITOR_SLIDER_SIZE * p_cfg->num_sliders));
    }
 #endif
 #if (TOUCH_CFG_NUM_WHEELS != 0)
    if (NULL != p_cfg->p_wheels)
    {
        g_touch_monitor_size[num] =
            (uint16_t) (g_touch_monitor_size[num] + TOUCH_MONITOR_WHEAD_SIZE +
                        (TOUCH_MONITOR_WHEEL_SIZE * p_cfg->num_wheels));
    }
 #endif
 #if (TOUCH_CFG_PAD_ENABLE)
    if (NULL != p_cfg->p_pad)
    {
        g_touch_monitor_size[num] = (uint16_t) (g_touch_monitor_size[num] / 2);
        g_touch_monitor_size[num] =
            (uint16_t) (g_touch_monitor_size[num] + TOUCH_MONITOR_PAD_TOTAL_SIZE);
    }
 #endif

    g_touch_monitor_size[num] =
        (uint16_t) (g_touch_monitor_size[num] + TOUCH_MONITOR_HEADER_SIZE + TOUCH_MONITOR_FOOTER_SIZE);

