xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
 #if (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)
    if (0 == g_touch_uart_open_bitmap)
    {
        g_touch_uart_config.async.baud_rate    = TOUCH_CFG_UART_BAUDRATE;
        g_touch_uart_config.async.clk_src      = SCI_CLK_INT;
        g_touch_uart_config.async.data_size    = SCI_DATA_8BIT;
        g_touch_uart_config.async.parity_en    = SCI_PARITY_OFF;
        g_touch_uart_config.async.parity_type  = SCI_EVEN_PARITY;
        g_touch_uart_config.async.stop_bits    = SCI_STOPBITS_1;
        g_touch_uart_config.async.int_priority = TOUCH_CFG_UART_PRIORITY;

        R_SCI_Open(TOUCH_CFG_UART_NUMBER, SCI_MODE_ASYNC, &g_touch_uart_config, touch_uart_callback, &g_touch_uart_control);

        R_SCI_Receive(g_touch_uart_control, &g_touch_uart_rx_buf[0] ,TOUCH_UART_RECIEVE_BUF_SIZE);

        g_touch_uart_monitor_num = TOUCH_UART_MONITOR_NONE;
    }

    g_touch_uart_open_bitmap |= ((uint32_t) 1 << num);
    gp_touch_ctrl_list[num]   = p_instance_ctrl;
 #endif
#endif

#if (TOUCH_CFG_UART_TUNING_SUPPORT == 1)
    touch_tuning_uart_connect();
#endif

    gp_touch_isr_context = p_instance_ctrl;

    /* Mark driver as open */
    p_instance_ctrl->open = TOUCH_OPEN;

    return err;
}

/*******************************************************************************************************************//**
 * @brief This function should be called each time a periodic timer expires.
 * If initial offset tuning is enabled, The first several calls are used to tuning for the sensors.
 * Before starting the next scan, first get the data with RM_TOUCH_DataGet().
 * If a different control block scan should be run, check the scan is complete before executing.
 * Implements @ref touch_api_t::scanStart.
 *
 * @retval FSP_SUCCESS              Successfully started.
 * @retval FSP_ERR_ASSERTION        Null pointer passed as a parameter.
 * @retval FSP_ERR_NOT_OPEN         Module is not open.
 * @retval FSP_ERR_CTSU_SCANNING    Scanning this instance or other.
 * @retval FSP_ERR_CTSU_NOT_GET_DATA    The previous data has not been retrieved by DataGet.
 **********************************************************************************************************************/
fsp_err_t RM_TOUCH_ScanStart (touch_ctrl_t * const p_ctrl)
{
    fsp_err_t               err             = FSP_SUCCESS;
    touch_instance_ctrl_t * p_instance_ctrl = (touch_instance_ctrl_t *) p_ctrl;
    gp_touch_isr_context = p_instance_ctrl;

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
    TOUCH_ERROR_RETURN(TOUCH_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
#endif

    err = p_instance_ctrl->p_ctsu_instance->p_api->scanStart(p_instance_ctrl->p_ctsu_instance->p_ctrl);
    FSP_ERROR_RETURN(FSP_ERR_CTSU_SCANNING != err, FSP_ERR_CTSU_SCANNING);
    FSP_ERROR_RETURN(FSP_ERR_CTSU_NOT_GET_DATA != err, FSP_ERR_CTSU_NOT_GET_DATA);

    return err;
}

/*******************************************************************************************************************//**
 * @brief Gets the 64-bit mask indicating which buttons are pressed.
 * Also, this function gets the current position of where slider or wheel is being pressed.
 * If initial offset tuning is enabled, The first several calls are used to tuning for the sensors.
 * Implements @ref touch_api_t::dataGet.
 *
 * @retval FSP_SUCCESS              Successfully data decoded.
 * @retval FSP_ERR_ASSERTION        Null pointer passed as a parameter.
 * @retval FSP_ERR_NOT_OPEN         Module is not open.
 * @retval FSP_ERR_CTSU_SCANNING    Scanning this instance.
 * @retval FSP_ERR_CTSU_INCOMPLETE_TUNING      Incomplete initial offset tuning.
 * @retval FSP_ERR_INVALID_HW_CONDITION        Values scanned by CTSU show abnormal values
 **********************************************************************************************************************/
fsp_err_t RM_TOUCH_DataGet (touch_ctrl_t * const p_ctrl,
                            uint64_t           * p_button_status,
                            uint16_t           * p_slider_position,
                            uint16_t           * p_wheel_position)
{
    fsp_err_t               err             = FSP_SUCCESS;
    touch_instance_ctrl_t * p_instance_ctrl = (touch_instance_ctrl_t *) p_ctrl;
    uint16_t                data[CTSU_CFG_NUM_SELF_ELEMENTS + (CTSU_CFG_NUM_MUTUAL_ELEMENTS * 2)];
#if ((TOUCH_CFG_NUM_BUTTONS != 0) || (TOUCH_CFG_NUM_SLIDERS != 0) || (TOUCH_CFG_NUM_WHEELS != 0))
    uint16_t sensor_val = 0;
 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
    int16_t  sensor_mutual_val = 0;
    int32_t  primary;
    int32_t  secondary;
    int32_t  mutual_diff;
 #endif
#endif
#if (TOUCH_CFG_NUM_BUTTONS != 0)
    uint8_t button_id;
#endif
#if (TOUCH_CFG_NUM_SLIDERS != 0)
    const touch_slider_cfg_t * p_slider;
    uint8_t  slider_id;
    uint16_t slider_data[TOUCH_SLIDER_ELEMENTS_MAX];
#endif
#if (TOUCH_CFG_NUM_WHEELS != 0)
    const touch_wheel_cfg_t * p_wheel;
    uint8_t  wheel_id;
    uint16_t wheel_data[TOUCH_WHEEL_ELEMENTS_LARGE];
#endif
#if ((TOUCH_CFG_NUM_SLIDERS != 0) || (TOUCH_CFG_NUM_WHEELS != 0))
    uint8_t element_id;
#endif
#if TOUCH_CFG_MONITOR_ENABLE
    uint16_t i;
    uint16_t index       = 0;
    uint8_t  element_num = 0;
#endif

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
 #if (TOUCH_CFG_NUM_BUTTONS != 0)
    if (0 != p_instance_ctrl->p_touch_cfg->num_buttons)
    {
        FSP_ASSERT(p_button_status);
    }
 #endif
 #if (TOUCH_CFG_NUM_SLIDERS != 0)
    if (0 != p_instance_ctrl->p_touch_cfg->num_sliders)
    {
        FSP_ASSERT(p_slider_position);
    }
 #endif
 #if (TOUCH_CFG_NUM_WHEELS != 0)
    if (0 != p_instance_ctrl->p_touch_cfg->num_wheels)
    {
        FSP_ASSERT(p_wheel_position);
    }
 #endif
    TOUCH_ERROR_RETURN(TOUCH_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
#endif

#if (TOUCH_CFG_UART_TUNING_SUPPORT == 1)
    if (true == p_instance_ctrl->serial_tuning_enable)
    {
        touch_serial_tuning(p_instance_ctrl);
    }

    /* Reconnection due to UART baud rate difference. */
    touch_tuning_baudrate_err_reconnect ();
#endif

    /* get results from previous scan */
    err = p_instance_ctrl->p_ctsu_instance->p_api->dataGet(p_instance_ctrl->p_ctsu_instance->p_ctrl, data);
    FSP_ERROR_RETURN(FSP_ERR_CTSU_SCANNING != err, FSP_ERR_CTSU_SCANNING);
    FSP_ERROR_RETURN(FSP_ERR_CTSU_INCOMPLETE_TUNING != err, FSP_ERR_CTSU_INCOMPLETE_TUNING);

#if (TOUCH_CFG_NUM_BUTTONS != 0)
    for (button_id = 0; button_id < p_instance_ctrl->p_touch_cfg->num_buttons; button_id++)
    {
 #if (CTSU_CFG_NUM_SELF_ELEMENTS != 0)
        if (CTSU_MODE_SELF_MULTI_SCAN == p_instance_ctrl->p_ctsu_instance->p_cfg->md)
        {
            sensor_val = *(data + p_instance_ctrl->p_touch_cfg->p_buttons[button_id].elem_index);
        }
 #endif
 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
        if (CTSU_MODE_MUTUAL_FULL_SCAN == (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->p_ctsu_instance->p_cfg->md))
        {
            primary   = (int32_t) *(data + (p_instance_ctrl->p_touch_cfg->p_buttons[button_id].elem_index * 2));
            secondary = (int32_t) *(data + (p_instance_ctrl->p_touch_cfg->p_buttons[button_id].elem_index * 2) + 1);
            mutual_diff = secondary - primary;
            FSP_ERROR_RETURN(secondary < TOUCH_MUTUAL_SECONDARY_MAX, FSP_ERR_INVALID_HW_CONDITION);
            FSP_ERROR_RETURN(mutual_diff < TOUCH_MUTUAL_INT16_MAX, FSP_ERR_INVALID_HW_CONDITION);
            FSP_ERROR_RETURN(mutual_diff > -TOUCH_MUTUAL_INT16_MAX, FSP_ERR_INVALID_HW_CONDITION);

