xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
            /* The value of Primary count minus secondary count */
            sensor_mutual_val = (int16_t) mutual_diff;
            sensor_val        = (uint16_t) sensor_mutual_val;
        }
 #endif
        if (0 == *(p_instance_ctrl->binfo.p_reference + button_id))
        {
            *(p_instance_ctrl->binfo.p_reference + button_id) = sensor_val;
        }
        else
        {
            /* Create button status */
 #if (CTSU_CFG_NUM_SELF_ELEMENTS != 0)
            if (CTSU_MODE_SELF_MULTI_SCAN == p_instance_ctrl->p_ctsu_instance->p_cfg->md)
            {
                touch_button_self_decode(&p_instance_ctrl->binfo, sensor_val, button_id);
                touch_button_drift(&p_instance_ctrl->binfo, sensor_val, button_id);
            }
 #endif
 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
            if (CTSU_MODE_MUTUAL_FULL_SCAN ==
                (CTSU_MODE_MUTUAL_FULL_SCAN & p_instance_ctrl->p_ctsu_instance->p_cfg->md))
            {
                touch_button_mutual_decode(&p_instance_ctrl->binfo, sensor_mutual_val, button_id);
                touch_button_mutual_drift(&p_instance_ctrl->binfo, sensor_mutual_val, button_id);
            }
 #endif
        }
    }

    /** status is 64-bitmap */
    *p_button_status = p_instance_ctrl->binfo.status;
#else
    FSP_PARAMETER_NOT_USED(p_button_status);
#endif

#if (TOUCH_CFG_NUM_SLIDERS != 0)

    /* Create slider position */
    for (slider_id = 0; slider_id < p_instance_ctrl->p_touch_cfg->num_sliders; slider_id++)
    {
        p_slider = (p_instance_ctrl->p_touch_cfg->p_sliders + slider_id);
        for (element_id = 0; element_id < p_slider->num_elements; element_id++)
        {
            sensor_val              = *(data + p_slider->p_elem_index[element_id]);
            slider_data[element_id] = sensor_val;
        }

        touch_slider_decode(&p_instance_ctrl->sinfo, slider_data, p_slider->num_elements, slider_id);

        *p_slider_position = *(p_instance_ctrl->sinfo.p_position + slider_id);
        p_slider_position++;
    }

#else
    FSP_PARAMETER_NOT_USED(p_slider_position);
#endif

#if (TOUCH_CFG_NUM_WHEELS != 0)
    for (wheel_id = 0; wheel_id < p_instance_ctrl->p_touch_cfg->num_wheels; wheel_id++)
    {
        p_wheel = (p_instance_ctrl->p_touch_cfg->p_wheels + wheel_id);
        for (element_id = 0; element_id < p_wheel->num_elements; element_id++)
        {
            sensor_val             = *(data + p_wheel->p_elem_index[element_id]);
            wheel_data[element_id] = sensor_val;
        }

        touch_wheel_decode(&p_instance_ctrl->winfo, wheel_data, p_wheel->num_elements, wheel_id);

        *p_wheel_position = *(p_instance_ctrl->winfo.p_position + wheel_id);
        p_wheel_position++;
    }

#else
    FSP_PARAMETER_NOT_USED(p_wheel_position);
#endif

#if TOUCH_CFG_MONITOR_ENABLE
 #if (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)
    if (!g_touch_uart_transmit_flag && (p_instance_ctrl->p_touch_cfg->number == g_touch_uart_monitor_num))
    {
        /* Monitor Data Notification */
        g_touch_monitor_buf[index++] = TOUCH_UART_HEADER;
        g_touch_monitor_buf[index++] = TOUCH_UART_RESPONSE_MONITOR;
        g_touch_monitor_buf[index++] = 0; /* Temporarily input the size */
        g_touch_monitor_buf[index++] = 0; /* Temporarily input the size */
    }

    if (!g_touch_uart_transmit_flag &&
        ((p_instance_ctrl->p_touch_cfg->number == g_touch_uart_monitor_num) ||
         (TOUCH_UART_MONITOR_NONE == g_touch_uart_monitor_num)))
    {
        if (TOUCH_UART_MONITOR_NONE == g_touch_uart_monitor_num)
        {
            for (i = 0; i < p_instance_ctrl->p_touch_cfg->number; i++)
            {
                index = (uint16_t) (index + g_touch_monitor_size[i]);
            }
        }

 #else
    for (i = 0; i < p_instance_ctrl->p_touch_cfg->number; i++)
    {
        index = (uint16_t) (index + g_touch_monitor_size[i]);
    }
 #endif
        g_touch_monitor_buf[index++] = g_touch_monitor_id;
        g_touch_monitor_buf[index++] = p_instance_ctrl->p_touch_cfg->number;
        if ((CTSU_MODE_SELF_MULTI_SCAN == p_instance_ctrl->p_ctsu_instance->p_cfg->md) ||
            (CTSU_MODE_CURRENT_SCAN == p_instance_ctrl->p_ctsu_instance->p_cfg->md))
        {
            g_touch_monitor_buf[index++] = 0x00;
            element_num = p_instance_ctrl->p_touch_cfg->p_ctsu_instance->p_cfg->num_rx;
            g_touch_monitor_buf[index++] = element_num;
            for (i = 0; i < element_num; i++)
            {
                g_touch_monitor_buf[index++] = (uint8_t) (data[i]);
                g_touch_monitor_buf[index++] = (uint8_t) (data[i] >> 8);
            }
        }
        else
        {
            g_touch_monitor_buf[index++] = 0x01;
            element_num = (uint8_t) (p_instance_ctrl->p_touch_cfg->p_ctsu_instance->p_cfg->num_rx *
                                     p_instance_ctrl->p_touch_cfg->p_ctsu_instance->p_cfg->num_tx);
            g_touch_monitor_buf[index++] = element_num;
            for (i = 0; i < (element_num * 2); i++)
            {
                g_touch_monitor_buf[index++] = (uint8_t) (data[i]);
                g_touch_monitor_buf[index++] = (uint8_t) (data[i] >> 8);
            }
        }

 #if (TOUCH_CFG_NUM_BUTTONS != 0)
        if (0 < p_instance_ctrl->p_touch_cfg->num_buttons)
        {
            g_touch_monitor_buf[index++] = 0x00;
            g_touch_monitor_buf[index++] = p_instance_ctrl->p_touch_cfg->num_buttons;
            for (i = 0; i < p_instance_ctrl->p_touch_cfg->num_buttons; i++)
            {
                g_touch_monitor_buf[index++] = (uint8_t) ((p_instance_ctrl->binfo.status >> i) & 0x01);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->binfo.p_reference[i]);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->binfo.p_reference[i] >> 8);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->binfo.p_threshold[i]);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->binfo.p_threshold[i] >> 8);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->binfo.p_hysteresis[i]);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->binfo.p_hysteresis[i] >> 8);
            }
        }
 #endif
 #if (TOUCH_CFG_NUM_SLIDERS != 0)
        if (0 < p_instance_ctrl->p_touch_cfg->num_sliders)
        {
            g_touch_monitor_buf[index++] = 0x01;
            g_touch_monitor_buf[index++] = p_instance_ctrl->p_touch_cfg->num_sliders;
            for (i = 0; i < p_instance_ctrl->p_touch_cfg->num_sliders; i++)
            {
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->sinfo.p_position[i]);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->sinfo.p_position[i] >> 8);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->sinfo.p_threshold[i]);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->sinfo.p_threshold[i] >> 8);
            }
        }
 #endif
 #if (TOUCH_CFG_NUM_WHEELS != 0)
        if (0 < p_instance_ctrl->p_touch_cfg->num_wheels)
        {
            g_touch_monitor_buf[index++] = 0x02;
            g_touch_monitor_buf[index++] = p_instance_ctrl->p_touch_cfg->num_wheels;
            for (i = 0; i < p_instance_ctrl->p_touch_cfg->num_wheels; i++)
            {
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->winfo.p_position[i]);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->winfo.p_position[i] >> 8);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->winfo.p_threshold[i]);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->winfo.p_threshold[i] >> 8);
            }
        }
 #endif
        g_touch_monitor_buf[index++] = g_touch_monitor_id++;

