xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
 #if (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)
    }

    if (!g_touch_uart_transmit_flag && (p_instance_ctrl->p_touch_cfg->number == g_touch_uart_monitor_num))
    {
        g_touch_monitor_buf[index++] = TOUCH_UART_FOOTER;
        g_touch_monitor_buf[2]       = (uint8_t) (index);
        g_touch_monitor_buf[3]       = (uint8_t) (index >> 8);
        g_touch_uart_transmit_flag   = 1;
        R_SCI_Send(g_touch_uart_control, &g_touch_monitor_buf[0] ,index);

    }
 #endif
#endif

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * @brief This function gets the current position of pad is being pressed.
 * Implements @ref touch_api_t::padDataGet , g_touch_on_ctsu
 *
 * @retval FSP_SUCCESS                  Successfully data decoded.
 * @retval FSP_ERR_ASSERTION            Null pointer.
 * @retval FSP_ERR_NOT_OPEN             Module is not open.
 * @retval FSP_ERR_CTSU_SCANNING        Scanning this instance.
 * @retval FSP_ERR_INVALID_HW_CONDITION Values scanned by CTSU show abnormal values
 **********************************************************************************************************************/
fsp_err_t RM_TOUCH_PadDataGet (touch_ctrl_t * const p_ctrl,
                               uint16_t           * p_pad_rx_coordinate,
                               uint16_t           * p_pad_tx_coordinate,
                               uint8_t            * p_pad_num_touch)
{
    fsp_err_t               err             = FSP_SUCCESS;
    touch_instance_ctrl_t * p_instance_ctrl = (touch_instance_ctrl_t *) p_ctrl;
#if (TOUCH_CFG_PAD_ENABLE)
    uint16_t i;
    uint16_t j;
    uint8_t  loop;
    uint8_t  num_x;
    uint8_t  num_y;
    int16_t  tmp_count;
    int16_t  tmp_value;
    int32_t  tmp_diff;
    uint16_t element_num;
    int32_t  drift_diff;
    uint8_t  max_touch;                /* number of max touch */
 #if (TOUCH_CFG_MONITOR_ENABLE)
    uint16_t index = 0;
 #endif
    int32_t  primary;
    int32_t  secondary;
    int32_t  mutual_diff;

 #if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
    FSP_ASSERT(p_pad_rx_coordinate);
    FSP_ASSERT(p_pad_tx_coordinate);
    FSP_ASSERT(p_pad_num_touch);
    TOUCH_ERROR_RETURN(TOUCH_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
 #endif

    /* initialize touch number and corrdinate */
    *(p_instance_ctrl->pinfo.p_num_touch)     = 0;
    *(p_instance_ctrl->pinfo.p_rx_coordinate) = TOUCH_OFF_VALUE;
    *(p_instance_ctrl->pinfo.p_tx_coordinate) = TOUCH_OFF_VALUE;

    /* Get local variable (TS number & data pinch) */
    num_x = p_instance_ctrl->p_touch_cfg->p_ctsu_instance->p_cfg->num_rx;
    TOUCH_ERROR_RETURN(0 != num_x, FSP_ERR_ASSERTION);
    num_y = p_instance_ctrl->p_touch_cfg->p_ctsu_instance->p_cfg->num_tx;
    TOUCH_ERROR_RETURN(0 != num_y, FSP_ERR_ASSERTION);
    element_num = (uint16_t) (num_x * num_y);

    /* Data get */
    err = p_instance_ctrl->p_ctsu_instance->p_api->dataGet(p_instance_ctrl->p_ctsu_instance->p_ctrl, (uint16_t *)g_touch_pad_buf);
    FSP_ERROR_RETURN(FSP_ERR_CTSU_SCANNING != err, FSP_ERR_CTSU_SCANNING);

    /* check for max touch */
    if (*(p_instance_ctrl->pinfo.p_max_touch) > TOUCH_PAD_MONITOR_TOUCH_NUM_MAX)
    {
        max_touch = TOUCH_PAD_MONITOR_TOUCH_NUM_MAX;
    }
    else
    {
        max_touch = *(p_instance_ctrl->pinfo.p_max_touch);
    }

    /* make difference value = secondary - primary */
    for (i = 0; i < element_num; i++)
    {
        primary   = g_touch_pad_buf[i * 2];
        secondary = g_touch_pad_buf[(i * 2) + 1];
        mutual_diff = secondary - primary;
        FSP_ERROR_RETURN(secondary < TOUCH_MUTUAL_SECONDARY_MAX, FSP_ERR_INVALID_HW_CONDITION);
        FSP_ERROR_RETURN(mutual_diff < TOUCH_MUTUAL_INT16_MAX, FSP_ERR_INVALID_HW_CONDITION);
        FSP_ERROR_RETURN(mutual_diff > -TOUCH_MUTUAL_INT16_MAX, FSP_ERR_INVALID_HW_CONDITION);

        /* save to buffer in the first half */
        g_touch_pad_buf[i] = (int16_t) mutual_diff;
    }

    /* Data get section */
    if (!g_touch_base_set_falg)
    {
        /* format base value , changing the order */
        for (j = 0; j < num_x; j++)
        {
            for (i = 0; i < num_y; i++)
            {
                *(p_instance_ctrl->pinfo.p_base_buf + j + (i * num_x)) = (uint16_t)
                    (g_touch_pad_buf[*(p_instance_ctrl->p_touch_cfg->p_pad->p_elem_index_rx + j) +
                                     (*(p_instance_ctrl->p_touch_cfg->p_pad->p_elem_index_tx + i) * num_x)]);
            }
        }

        g_touch_base_set_falg = 1;
    }
    else
    {
        /* format difference value  */
        for (j = 0; j < num_x; j++)
        {
            for (i = 0; i < num_y; i++)
            {
                /* get count data ,and changing the order */
                tmp_value = g_touch_pad_buf[*(p_instance_ctrl->p_touch_cfg->p_pad->p_elem_index_rx + j) +
                                            (*(p_instance_ctrl->p_touch_cfg->p_pad->p_elem_index_tx + i) * num_x)];

                /* make difference from base value */
                tmp_diff = (int32_t)(*(p_instance_ctrl->pinfo.p_base_buf + j + (i * num_x)));
                tmp_diff = tmp_diff - tmp_value;

                /* save difference value to buffer in the second half */
                g_touch_pad_buf[element_num + j + (i * num_x)] = (int16_t) tmp_diff;
            }
        }
    }

 #if (TOUCH_CFG_MONITOR_ENABLE)

    /* copy from second half to first half for monitor */
    for (i = 0; i < element_num; i++)
    {
        g_touch_pad_buf[i] = g_touch_pad_buf[element_num + i];
    }
 #endif

    if (g_touch_base_set_falg)
    {
        touch_pad_decode(&p_instance_ctrl->pinfo, num_x, num_y, max_touch);

        /* the drift correction process. */
        if (0 < p_instance_ctrl->pinfo.num_drift)
        {
            if (0 == *(p_instance_ctrl->pinfo.p_num_touch))
            {
                /* If not touching, drift correction counter's being incremented */
                (*(p_instance_ctrl->pinfo.p_drift_count))++;

                for (i = 0; i < num_y; i++)
                {
                    for (j = 0; j < num_x; j++)
                    {
                        /* It is an addition for the drift correction average calculation */
                        tmp_count = g_touch_pad_buf[element_num + j + (i * num_x)];

