xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
                        drift_diff  = (int32_t)(*(p_instance_ctrl->pinfo.p_drift_buf + (j + (i * num_x))));
                        drift_diff += (int32_t) tmp_count;
                        *(p_instance_ctrl->pinfo.p_drift_buf + (j + (i * num_x))) = (uint32_t)drift_diff;

                        if (*(p_instance_ctrl->pinfo.p_drift_count) >= p_instance_ctrl->pinfo.num_drift)
                        {
                            drift_diff = (int32_t) (*(p_instance_ctrl->pinfo.p_drift_buf + j + (i * num_x)) /
                                                    *(p_instance_ctrl->pinfo.p_drift_count));

                            *(p_instance_ctrl->pinfo.p_base_buf + j + (i * num_x)) =
                                (uint16_t) ((int32_t) (*(p_instance_ctrl->pinfo.p_base_buf + j + (i * num_x))) -
                                            drift_diff);

                            /* Clear total value for the average */
                            *(p_instance_ctrl->pinfo.p_drift_buf + (j + (i * num_x))) = 0;
                        }
                    }
                }

                if (*(p_instance_ctrl->pinfo.p_drift_count) >= p_instance_ctrl->pinfo.num_drift)
                {
                    /* Count clear */
                    *(p_instance_ctrl->pinfo.p_drift_count) = 0;
                }
            }
        }
    }

    /* Set user data */
    loop = 0;
    do
    {
        *(p_pad_rx_coordinate + loop) = *(p_instance_ctrl->pinfo.p_rx_coordinate + loop);
        *(p_pad_tx_coordinate + loop) = *(p_instance_ctrl->pinfo.p_tx_coordinate + loop);
        loop++;
    } while (loop < max_touch);

    *p_pad_num_touch = (uint8_t) (*(p_instance_ctrl->pinfo.p_num_touch));

    /* Monitor part of ready */
 #if (TOUCH_CFG_MONITOR_ENABLE)
  #if (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)
    if (!g_touch_uart_transmit_flag && (p_instance_ctrl->p_touch_cfg->number == g_touch_uart_monitor_num))
    {
        /* Monitor Data Notification */
        g_touch_monitor_buf[index++] = TOUCH_UART_HEADER;
        g_touch_monitor_buf[index++] = TOUCH_UART_RESPONSE_MONITOR2;
        g_touch_monitor_buf[index++] = 0; /* Temporarily input the size */
        g_touch_monitor_buf[index++] = 0; /* Temporarily input the size */
    }

    if (!g_touch_uart_transmit_flag &&
        ((p_instance_ctrl->p_touch_cfg->number == g_touch_uart_monitor_num) ||
         (TOUCH_UART_MONITOR_NONE == g_touch_uart_monitor_num)))
    {
        if (TOUCH_UART_MONITOR_NONE == g_touch_uart_monitor_num)
        {
            for (i = 0; i < p_instance_ctrl->p_touch_cfg->number; i++)
            {
                index = (uint16_t) (index + g_touch_monitor_size[i]);
            }
        }

  #else                                /* TOUCH_CFG_UART_MONITOR_SUPPORT */
    for (i = 0; i < p_instance_ctrl->p_touch_cfg->number; i++)
    {
        index = (uint16_t) (index + g_touch_monitor_size[i]);
    }
  #endif

        g_touch_monitor_buf[index++] = g_touch_monitor_id;
        g_touch_monitor_buf[index++] = p_instance_ctrl->p_touch_cfg->number;

        /* Pad data */
        g_touch_monitor_buf[index++] = 0x02;
        g_touch_monitor_buf[index++] = (uint8_t) element_num;

        for (i = 0; i < element_num; i++)
        {
            tmp_value = g_touch_pad_buf[i];
            if (tmp_value < 0)
            {
                tmp_value = 0;
            }
            g_touch_monitor_buf[index++] = (uint8_t) (tmp_value);
            g_touch_monitor_buf[index++] = (uint8_t) (tmp_value >> 8);
        }

        g_touch_monitor_buf[index++] = 0x03;                                              /* id of Pad     */
        g_touch_monitor_buf[index++] = 0x01;                                              /* number of Pad */

        g_touch_monitor_buf[index++] = (uint8_t) (*(p_instance_ctrl->pinfo.p_num_touch)); /* number of touch    */
        for (i = 0; i < TOUCH_PAD_MONITOR_TOUCH_NUM_MAX; i++)
        {
            if (i <= max_touch)
            {
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->pinfo.p_rx_coordinate[i]);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->pinfo.p_rx_coordinate[i] >> 8);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->pinfo.p_tx_coordinate[i]);
                g_touch_monitor_buf[index++] = (uint8_t) (p_instance_ctrl->pinfo.p_tx_coordinate[i] >> 8);
            }
            else
            {
                g_touch_monitor_buf[index++] = (uint8_t) (TOUCH_OFF_VALUE);
                g_touch_monitor_buf[index++] = (uint8_t) (TOUCH_OFF_VALUE >> 8);
                g_touch_monitor_buf[index++] = (uint8_t) (TOUCH_OFF_VALUE);
                g_touch_monitor_buf[index++] = (uint8_t) (TOUCH_OFF_VALUE >> 8);
            }
        }

        g_touch_monitor_buf[index++] = (uint8_t) (*(p_instance_ctrl->pinfo.p_threshold));
        g_touch_monitor_buf[index++] = (uint8_t) ((*(p_instance_ctrl->pinfo.p_threshold)) >> 8);
        g_touch_monitor_buf[index++] = (uint8_t) (*(p_instance_ctrl->pinfo.p_rx_pixel));
        g_touch_monitor_buf[index++] = (uint8_t) ((*(p_instance_ctrl->pinfo.p_rx_pixel)) >> 8);
        g_touch_monitor_buf[index++] = (uint8_t) (*(p_instance_ctrl->pinfo.p_tx_pixel));
        g_touch_monitor_buf[index++] = (uint8_t) ((*(p_instance_ctrl->pinfo.p_tx_pixel)) >> 8);
        g_touch_monitor_buf[index++] = (*(p_instance_ctrl->pinfo.p_max_touch));
        g_touch_monitor_buf[index++] = (p_instance_ctrl->pinfo.num_drift);
        g_touch_monitor_buf[index++] = g_touch_monitor_id++;

  #if (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)
    }

    if (p_instance_ctrl->p_touch_cfg->number == g_touch_uart_monitor_num)
    {
        g_touch_monitor_buf[index++] = TOUCH_UART_FOOTER;
        g_touch_monitor_buf[2]       = (uint8_t) (index);
        g_touch_monitor_buf[3]       = (uint8_t) (index >> 8);
        g_touch_uart_transmit_flag   = 1;
        gp_touch_uart_instance->p_api->write(gp_touch_uart_instance->p_ctrl,
                                             (uint8_t *) g_touch_monitor_buf,
                                             index);
    }
  #endif
 #endif                                /* TOUCH_CFG_MONITOR_ENABLE */
#else  /* TOUCH_CFG_PAD_ENABLE */
 #if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
    FSP_ASSERT(p_pad_rx_coordinate);
    FSP_ASSERT(p_pad_tx_coordinate);
    FSP_ASSERT(p_pad_num_touch);
    TOUCH_ERROR_RETURN(TOUCH_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
 #endif
    FSP_PARAMETER_NOT_USED(p_pad_rx_coordinate);
    FSP_PARAMETER_NOT_USED(p_pad_tx_coordinate);
    FSP_PARAMETER_NOT_USED(p_pad_num_touch);
    FSP_PARAMETER_NOT_USED(p_instance_ctrl);
    FSP_PARAMETER_NOT_USED(FSP_ERR_CTSU_SCANNING);
#endif                                 /* TOUCH_CFG_PAD_ENABLE */
    return err;
}

/*******************************************************************************************************************//**
 * @brief Scan stop specified TOUCH control block. Implements @ref touch_api_t::scanStop.
 *
 * @retval FSP_SUCCESS              Successfully closed.
 * @retval FSP_ERR_ASSERTION        Null pointer passed as a parameter.
 * @retval FSP_ERR_NOT_OPEN         Module is not open.
 **********************************************************************************************************************/
fsp_err_t RM_TOUCH_ScanStop (touch_ctrl_t * const p_ctrl)
{
    touch_instance_ctrl_t * p_instance_ctrl = (touch_instance_ctrl_t *) p_ctrl;
    fsp_err_t               err             = FSP_SUCCESS;

