xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
    FSP_ASSERT(p_instance_ctrl);
    TOUCH_ERROR_RETURN(TOUCH_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);

    err = p_instance_ctrl->p_ctsu_instance->p_api->scanStop(p_instance_ctrl->p_ctsu_instance->p_ctrl);

    return err;
}

/*******************************************************************************************************************//**
 * Updates the user callback and has option of providing memory for callback structure.
 * Implements touch_api_t::callbackSet
 *
 * @retval  FSP_SUCCESS                  Callback updated successfully.
 * @retval  FSP_ERR_ASSERTION            A required pointer is NULL.
 * @retval  FSP_ERR_NOT_OPEN             The control block has not been opened.
 **********************************************************************************************************************/
fsp_err_t RM_TOUCH_CallbackSet (touch_ctrl_t * const          p_api_ctrl,
                                void (                      * p_callback)(touch_callback_args_t *),
                                void const * const            p_context,
                                touch_callback_args_t * const p_callback_memory)
{
    fsp_err_t               err    = FSP_SUCCESS;
    touch_instance_ctrl_t * p_ctrl = (touch_instance_ctrl_t *) p_api_ctrl;

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_ctrl);
    FSP_ASSERT(p_callback);
    FSP_ERROR_RETURN(TOUCH_OPEN == p_ctrl->open, FSP_ERR_NOT_OPEN);
#endif

    err = p_ctrl->p_ctsu_instance->p_api->callbackSet(p_ctrl->p_ctsu_instance->p_ctrl,
                                                      p_callback,
                                                      p_context,
                                                      p_callback_memory);

    return err;
}

/*******************************************************************************************************************//**
 * @brief Disables specified TOUCH control block. Implements @ref touch_api_t::close.
 *
 * @retval FSP_SUCCESS              Successfully closed.
 * @retval FSP_ERR_ASSERTION        Null pointer passed as a parameter.
 * @retval FSP_ERR_NOT_OPEN         Module is not open.
 **********************************************************************************************************************/
fsp_err_t RM_TOUCH_Close (touch_ctrl_t * const p_ctrl)
{
    touch_instance_ctrl_t * p_instance_ctrl = (touch_instance_ctrl_t *) p_ctrl;
    fsp_err_t               err             = FSP_SUCCESS;
#if (TOUCH_CFG_UART_TUNING_SUPPORT == 1)
    uint8_t num = 0;
#endif

    FSP_ASSERT(p_instance_ctrl);
    TOUCH_ERROR_RETURN(TOUCH_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);

#if (TOUCH_CFG_NUM_BUTTONS != 0)
    g_touch_button_index = (uint8_t) (g_touch_button_index - p_instance_ctrl->p_touch_cfg->num_buttons);
#endif
#if (TOUCH_CFG_NUM_SLIDERS != 0)
    g_touch_slider_index = (uint8_t) (g_touch_slider_index - p_instance_ctrl->p_touch_cfg->num_sliders);
#endif
#if (TOUCH_CFG_NUM_WHEELS != 0)
    g_touch_wheel_index = (uint8_t) (g_touch_wheel_index - p_instance_ctrl->p_touch_cfg->num_wheels);
#endif

    err = p_instance_ctrl->p_ctsu_instance->p_api->close(p_instance_ctrl->p_ctsu_instance->p_ctrl);
    p_instance_ctrl->open = false;

#if TOUCH_CFG_MONITOR_ENABLE
 #if (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)
    g_touch_uart_open_bitmap &= ~((uint32_t) 1 << p_instance_ctrl->p_touch_cfg->number);
    gp_touch_ctrl_list[p_instance_ctrl->p_touch_cfg->number] = p_instance_ctrl;
    if (0 == g_touch_uart_open_bitmap)
    {
        R_SCI_Close(g_touch_uart_control);
        g_touch_uart_control   = NULL;
        g_touch_uart_monitor_num = TOUCH_UART_MONITOR_NONE;
    }
 #endif
#endif

#if (TOUCH_CFG_UART_TUNING_SUPPORT == 1)
    if (NULL != g_touch_uart_control)
    {
 #if (TOUCH_CFG_NUM_BUTTONS != 0)
        num = g_touch_button_index;
 #endif
 #if (TOUCH_CFG_NUM_SLIDERS != 0)
        num = (uint8_t) (num + g_touch_slider_index);
 #endif
 #if (TOUCH_CFG_NUM_WHEELS != 0)
        num = (uint8_t) (num + g_touch_wheel_index);
 #endif
        if (0 == num)
        {
            R_SCI_Close(g_touch_uart_control);
            g_touch_uart_control   = NULL;
        }
    }
#endif

    return err;
}

/*******************************************************************************************************************//**
 * @brief Get the touch sensitivity ratio. Implements @ref touch_api_t::sensitivityRatioGet.
 *
 * @retval FSP_SUCCESS                         Successfully touch sensitivity ratio got.
 * @retval FSP_ERR_ASSERTION                   Null pointer passed as a parameter.
 * @retval FSP_ERR_NOT_OPEN                    Module is not open.
 * @retval FSP_ERR_CTSU_SCANNING               Scanning this instance.
 * @retval FSP_ERR_CTSU_INCOMPLETE_TUNING      Incomplete initial offset tuning.
 **********************************************************************************************************************/
fsp_err_t RM_TOUCH_SensitivityRatioGet (touch_ctrl_t * const       p_ctrl,
                                        touch_sensitivity_info_t * p_touch_sensitivity_info)
{
    fsp_err_t               err             = FSP_SUCCESS;
    touch_instance_ctrl_t * p_instance_ctrl = (touch_instance_ctrl_t *) p_ctrl;
    uint16_t                data[CTSU_CFG_NUM_SELF_ELEMENTS + (CTSU_CFG_NUM_MUTUAL_ELEMENTS * 2)];
    uint8_t                 button_id;

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
    FSP_ASSERT(p_touch_sensitivity_info);
    TOUCH_ERROR_RETURN(TOUCH_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
#endif

    err = p_instance_ctrl->p_ctsu_instance->p_api->dataGet(p_instance_ctrl->p_ctsu_instance->p_ctrl, data);
    FSP_ERROR_RETURN(FSP_ERR_CTSU_SCANNING != err, FSP_ERR_CTSU_SCANNING);
    FSP_ERROR_RETURN(FSP_ERR_CTSU_INCOMPLETE_TUNING != err, FSP_ERR_CTSU_INCOMPLETE_TUNING);

    for (button_id = 0; button_id < p_instance_ctrl->p_touch_cfg->num_buttons; button_id++)
    {
#if (CTSU_CFG_NUM_SELF_ELEMENTS != 0)
        if (CTSU_MODE_SELF_MULTI_SCAN == p_instance_ctrl->p_ctsu_instance->p_cfg->md)
        {
            if (0 > ((int32_t) data[button_id] - p_instance_ctrl->binfo.p_reference[button_id]))
            {
                p_touch_sensitivity_info->p_touch_sensitivity_ratio[button_id] = 0;
            }
            else
            {
                p_touch_sensitivity_info->p_touch_sensitivity_ratio[button_id] =
                    (uint16_t) (((int32_t) data[button_id] - p_instance_ctrl->binfo.p_reference[button_id]) *
                                p_touch_sensitivity_info->new_threshold_ratio /
                                p_instance_ctrl->binfo.p_threshold[button_id]);
            }
        }
#endif
#if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
        if (CTSU_MODE_MUTUAL_FULL_SCAN == p_instance_ctrl->p_ctsu_instance->p_cfg->md)
        {
            if (0 >
                ((int32_t) p_instance_ctrl->binfo.p_reference[button_id] -
                 (data[button_id * 2 + 1] - data[button_id * 2])))
            {
                p_touch_sensitivity_info->p_touch_sensitivity_ratio[button_id] = 0;
            }
            else
            {
                p_touch_sensitivity_info->p_touch_sensitivity_ratio[button_id] =
                    (uint16_t) (((int32_t) p_instance_ctrl->binfo.p_reference[button_id] -
                                 (data[button_id * 2 + 1] - data[button_id * 2])) *
                                p_touch_sensitivity_info->new_threshold_ratio /
                                p_instance_ctrl->binfo.p_threshold[button_id]);
            }
        }
#endif
        else
        {
            /* Not supported */
        }
    }

