xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * @brief Adjust the touch judgment threshold. Implements @ref touch_api_t::thresholdAdjust.
 *
 * @retval FSP_SUCCESS              Successfully touch judgment threshold was adjusted.
 * @retval FSP_ERR_ASSERTION        Null pointer passed as a parameter.
 * @retval FSP_ERR_NOT_OPEN         Module is not open.
 **********************************************************************************************************************/
fsp_err_t RM_TOUCH_ThresholdAdjust (touch_ctrl_t * const p_ctrl, touch_sensitivity_info_t * p_touch_sensitivity_info)
{
    touch_instance_ctrl_t * p_instance_ctrl = (touch_instance_ctrl_t *) p_ctrl;
    uint8_t                 button_id;
    uint32_t                touch_sensitivity_ratio_32bit;

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
    FSP_ASSERT(p_touch_sensitivity_info);
    FSP_ASSERT(p_touch_sensitivity_info->old_threshold_ratio);
    TOUCH_ERROR_RETURN(TOUCH_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
#endif

    /* The threshold value for a touch condition is calculated by the QE Tool to be 60% of the
     * Touch Count - No Touch Count.
     * Similarly, the hysteresis is set by QE tool as 5% of the threshold value.
     * This threshold value (as a percentage) can be modified by passing in the parameters:
     *   old_threshold_ratio    : value set by QE tool
     *   new_threshold_ratio    : required value
     *   new_hysteresis_ratio   : required hysteresis
     */

    for (button_id = 0; button_id < p_instance_ctrl->p_touch_cfg->num_buttons; button_id++)
    {
        /* Modify the threshold and hysteresis for each button */
        p_instance_ctrl->binfo.p_threshold[button_id] =
            (uint16_t) ((uint32_t) p_instance_ctrl->p_touch_cfg->p_buttons[button_id].threshold *
                        p_touch_sensitivity_info->new_threshold_ratio / p_touch_sensitivity_info->old_threshold_ratio);
        p_instance_ctrl->binfo.p_hysteresis[button_id] = TOUCH_RATIO_CALC(
            p_instance_ctrl->binfo.p_threshold[button_id] * p_touch_sensitivity_info->new_hysteresis_ratio);

        /* Now adjust these values with the threshold offset values that are passed in via p_modifier */
        touch_sensitivity_ratio_32bit =
            (uint32_t) p_touch_sensitivity_info->p_touch_sensitivity_ratio[button_id];
        touch_sensitivity_ratio_32bit = TOUCH_RATIO_CALC(
            touch_sensitivity_ratio_32bit * p_instance_ctrl->binfo.p_threshold[button_id]);
        p_instance_ctrl->binfo.p_threshold[button_id]  = (uint16_t) touch_sensitivity_ratio_32bit;
        p_instance_ctrl->binfo.p_hysteresis[button_id] = TOUCH_RATIO_CALC(
            touch_sensitivity_ratio_32bit * p_touch_sensitivity_info->new_hysteresis_ratio);
    }

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * @brief Control drift correction. Implements @ref touch_api_t::driftControl.
 *
 * @retval FSP_SUCCESS              Successfully drift correction was controlled.
 * @retval FSP_ERR_ASSERTION        Null pointer passed as a parameter.
 * @retval FSP_ERR_NOT_OPEN         Module is not open.
 **********************************************************************************************************************/
fsp_err_t RM_TOUCH_DriftControl (touch_ctrl_t * const p_ctrl, uint16_t input_drift_freq)
{
    touch_instance_ctrl_t * p_instance_ctrl = (touch_instance_ctrl_t *) p_ctrl;

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
    TOUCH_ERROR_RETURN(TOUCH_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
#endif

    p_instance_ctrl->binfo.drift_freq = input_drift_freq;

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * @brief This function get the variable address of QE Monitor. 
 * This function is used for QE Monitor when both automatic judgement and software judgement are operated.
 * Implements @ref touch_api_t::monitorAddressGet
 *
 * @retval FSP_SUCCESS              Successfully QE monitor variable address was got.
 * @retval FSP_ERR_ASSERTION        Null pointer passed as a parameter.
 * @retval FSP_ERR_NOT_OPEN         Module is not open.
 * @retval FSP_ERR_NOT_ENABLED      Requested operation is not enabled
 **********************************************************************************************************************/
fsp_err_t RM_TOUCH_MonitorAddressGet (touch_ctrl_t * const p_ctrl,
                                        uint32_t * p_monitor_buf,
                                        uint32_t * p_monitor_id,
                                        uint32_t * p_monitor_size)
{
#if (CTSU_CFG_AUTO_JUDGE_ENABLE == 1)
 #if TOUCH_CFG_MONITOR_ENABLE
    touch_instance_ctrl_t * p_instance_ctrl = (touch_instance_ctrl_t *) p_ctrl;

  #if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    FSP_ASSERT(p_instance_ctrl);
    TOUCH_ERROR_RETURN(TOUCH_OPEN == p_instance_ctrl->open, FSP_ERR_NOT_OPEN);
  #endif

    * p_monitor_buf  = (uint32_t)g_touch_monitor_buf;
    * p_monitor_id   = (uint32_t)&g_touch_monitor_id;
    * p_monitor_size = (uint32_t)g_touch_monitor_size;
    return FSP_SUCCESS;
 #else
    FSP_PARAMETER_NOT_USED(p_monitor_buf);
    FSP_PARAMETER_NOT_USED(p_monitor_id);
    FSP_PARAMETER_NOT_USED(p_monitor_size);
    FSP_PARAMETER_NOT_USED(p_ctrl);
    return FSP_ERR_NOT_ENABLED;
 #endif
#else
    FSP_PARAMETER_NOT_USED(p_monitor_buf);
    FSP_PARAMETER_NOT_USED(p_monitor_id);
    FSP_PARAMETER_NOT_USED(p_monitor_size);
    FSP_PARAMETER_NOT_USED(p_ctrl);
    return FSP_ERR_NOT_ENABLED;
#endif
}

/*******************************************************************************************************************//**
 * @} (end addtogroup TOUCH)
 **********************************************************************************************************************/

