xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
/***********************************************************************************************************************
 * Private Functions
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * Internal touch private function.
 **********************************************************************************************************************/

#if (TOUCH_CFG_NUM_BUTTONS != 0)
 #if (CTSU_CFG_NUM_SELF_ELEMENTS != 0)

/***********************************************************************************************************************
 * Function Name: touch_button_self_decode
 * Description  : Self Touch Button decoding
 * Arguments    : touch_button_info_t  p_binfo : Pointer to Button Information structure
 *              : uint16_t value               : Sensor value from CTSU
 *              : uint8_t  button_id           : Button ID
 * Return Value : None
 ***********************************************************************************************************************/
void touch_button_self_decode (touch_button_info_t * p_binfo, uint16_t value, uint8_t button_id)
{
    uint32_t threshold;
    uint16_t threshold_sub_hys;

    threshold = (uint32_t) (*(p_binfo->p_reference + button_id) + *(p_binfo->p_threshold + button_id));
    if (TOUCH_COUNT_MAX < threshold)
    {
        return;
    }

    threshold_sub_hys = (uint16_t) (threshold - (*(p_binfo->p_hysteresis + button_id)));

    /* threshold_sub_hys < scan value = Touch */
    if (threshold < value)
    {
        touch_button_on(p_binfo, value, button_id);
    }
    else if (threshold_sub_hys > value)
    {
        touch_button_off(p_binfo, button_id);
    }
  #if (0 == TOUCH_CFG_CHATTERING_SUPPRESSION_TYPE)
    else
    {
        /* Do nothing during hysteresis */
    }
  #else
    else
    {
        /* touch count reset during hysteresis */
        (*(p_binfo->p_on_count + button_id))  = 0;
        (*(p_binfo->p_off_count + button_id)) = 0;
    }
  #endif
}

 #endif

 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)

/***********************************************************************************************************************
 * Function Name: touch_button_mutual_decode
 * Description  : Mutual Touch Button decoding
 * Arguments    : touch_button_info_t  p_binfo : Pointer to Button Information structure
 *              : int16_t value                : Sensor value from CTSU
 *              : uint8_t  button_id           : Button ID
 * Return Value : None
 ***********************************************************************************************************************/
void touch_button_mutual_decode (touch_button_info_t * p_binfo, int16_t value, uint8_t button_id)
{
    int16_t  threshold;
    int16_t  reference;
    int16_t  hysteresis;
    int32_t  hysteresis_32;

    reference = (int16_t)*(p_binfo->p_reference + button_id);
    threshold = (int16_t)*(p_binfo->p_threshold + button_id);
    threshold = (int16_t)(reference - threshold);

    /* get current threshold_add_hys */
    hysteresis_32 = (int32_t)*(p_binfo->p_hysteresis + button_id);
    hysteresis_32 = (int32_t)threshold + hysteresis_32;

    /* error process (touch_cnt is 16bit) */
    if ((TOUCH_MUTUAL_INT16_MAX < hysteresis_32) ||
       (-TOUCH_MUTUAL_INT16_MAX > hysteresis_32))
    {
        return;
    }

    hysteresis = (int16_t)hysteresis_32;

    /* threshold_add_hys > scan value = Touch */
    if (threshold > value)
    {
        touch_button_on(p_binfo, (uint16_t)value, button_id);
    }
    else if (hysteresis < value)
    {
        touch_button_off(p_binfo, button_id);
    }
  #if (0 == TOUCH_CFG_CHATTERING_SUPPRESSION_TYPE)
    else
    {
        /* Do nothing during hysteresis */
    }
  #else
    else
    {
        /* touch count reset during hysteresis */
        (*(p_binfo->p_on_count + button_id))  = 0;
        (*(p_binfo->p_off_count + button_id)) = 0;
    }
  #endif
}                                      /* End of function touch_button_decode() */

 #endif

/***********************************************************************************************************************
 * Function Name: touch_button_on
 * Description  : Touch Button ON judge process
 * Arguments    : touch_button_info_t  p_binfo : Pointer to Button Information structure
 *              : uint16_t value               : Sensor value from CTSU
 *              : uint8_t  button_id           : Button ID
 * Return Value : None
 ***********************************************************************************************************************/
void touch_button_on (touch_button_info_t * p_binfo, uint16_t value, uint8_t button_id)
{
    *(p_binfo->p_off_count + button_id) = 0; /* non_touch count reset */

    /* ===== touch ON result ===== */
    if (p_binfo->on_freq <= (*(p_binfo->p_on_count + button_id)))
    {
        p_binfo->status |= ((uint64_t) 1 << button_id);
    }
    else
    {
        (*(p_binfo->p_on_count + button_id))++;
    }

    /* ===== The reset judgment processing at the time of continuation on ===== */
    if (p_binfo->cancel_freq > p_binfo->on_freq)
    {
        /* If reaching max_on_threshold, it makes result off and it revises a drift. */
        if (p_binfo->cancel_freq <= (*(p_binfo->p_on_count + button_id)))
        {
            p_binfo->status &= ~(((uint64_t) 1 << button_id));
            *(p_binfo->p_on_count + button_id)  = 0;
            *(p_binfo->p_reference + button_id) = value;
        }
        else
        {
            (*(p_binfo->p_on_count + button_id))++;
        }
    }
}                                      /* End of function touch_button_on() */

/***********************************************************************************************************************
 * Function Name: touch_button_off
 * Description  : Touch Button OFF judge process
 * Arguments    : touch_button_info_t  p_binfo : Pointer to Button Information structure
 *              : uint16_t value               : Sensor value from CTSU
 *              : uint8_t  button_id           : Button ID
 * Return Value : None
 ***********************************************************************************************************************/
void touch_button_off (touch_button_info_t * p_binfo, uint8_t button_id)
{
    *(p_binfo->p_on_count + button_id) = 0; /* touch count reset */

    /* ===== touch OFF result ===== */
    if (p_binfo->off_freq <= (*(p_binfo->p_off_count + button_id)))
    {
        p_binfo->status &= ~(((uint64_t) 1 << button_id));
    }
    else
    {
        (*(p_binfo->p_off_count + button_id))++;
    }
}                                      /* End of function touch_button_off() */

 #if (CTSU_CFG_NUM_SELF_ELEMENTS != 0)
/***********************************************************************************************************************
 * Function Name: touch_button_drift
 * Description  : Touch Button drift process
 * Arguments    : touch_button_info_t  p_binfo : Pointer to Button Information structure
 *              : uint16_t value               : Sensor value from CTSU
 *              : uint8_t  button_id           : Button ID
 * Return Value : None
 ***********************************************************************************************************************/
void touch_button_drift (touch_button_info_t * p_binfo, uint16_t value, uint8_t button_id)
{
    if (0 != p_binfo->drift_freq)
    {
        /* In case of doing drift correction being and moreover On/Off judgment result 1=OFF */
        if (0 == (p_binfo->status & (((uint64_t) 1 << button_id))))
        {
            /* It is an addition for the drift correction average calculation */
            *(p_binfo->p_drift_buf + button_id) += value;

            /* Drift correction counter's being incremented */
            (*(p_binfo->p_drift_count + button_id))++;

            if (*(p_binfo->p_drift_count + button_id) >= p_binfo->drift_freq)
            {
                /* If reaching the correction number of times */
                *(p_binfo->p_reference +
                  button_id) = (uint16_t) (*(p_binfo->p_drift_buf + button_id) / p_binfo->drift_freq);

                /* To REF of the average */
                *(p_binfo->p_drift_buf + button_id) = 0;

                /* Work clear */
                *(p_binfo->p_drift_count + button_id) = 0;
            }
        }
        else
        {
            /* To REF of the average */
            *(p_binfo->p_drift_buf + button_id) = 0;

            /* Work clear */
            *(p_binfo->p_drift_count + button_id) = 0;
        }
    }
}
 #endif

 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
/***********************************************************************************************************************
 * Function Name: touch_button_mutual_drift
 * Description  : Touch Button drift process
 * Arguments    : touch_button_info_t  p_binfo : Pointer to Button Information structure
 *              : int16_t value                : Sensor value from CTSU
 *              : uint8_t  button_id           : Button ID
 * Return Value : None
 ***********************************************************************************************************************/
void touch_button_mutual_drift (touch_button_info_t * p_binfo, int16_t value, uint8_t button_id)
{
    uint32_t    *p_drift_buf;
    uint16_t    *p_drift_count;
    uint16_t    *p_reference;
    int32_t     drift_mutual;

    p_drift_buf   = (uint32_t *)(p_binfo->p_drift_buf   + button_id);
    p_drift_count = (uint16_t *)(p_binfo->p_drift_count + button_id);
    p_reference   = (uint16_t *)(p_binfo->p_reference   + button_id);

