xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
    dsum = (uint16_t) (d1 + d2);

    if (0 == d1)
    {
        d1 = 1;
    }

    /* Constant decision for operation of angle of wheel    */
    if (dsum > *(p_winfo->p_threshold + wheel_id))
    {
        d3 = (uint16_t) (TOUCH_DECIMAL_POINT_PRECISION + ((d2 * TOUCH_DECIMAL_POINT_PRECISION) / d1));

        unit       = (uint16_t) (TOUCH_WHEEL_RESOLUTION / num_elements);
        wheel_rpos = (uint16_t) (((unit * TOUCH_DECIMAL_POINT_PRECISION) / d3) + (unit * max_data_num));

        /* Angle division output */
        /* diff_angle_ch = 0 -> 359 ------ diff_angle_ch output 1 to 360 */
        if (0 == wheel_rpos)
        {
            wheel_rpos = TOUCH_WHEEL_RESOLUTION;
        }
        else if ((TOUCH_WHEEL_RESOLUTION + 1) < wheel_rpos)
        {
            wheel_rpos = 1;
        }
        else
        {
            /* Do Nothing */
        }
    }
    else
    {
        wheel_rpos = TOUCH_OFF_VALUE;
    }

    *(p_winfo->p_position + wheel_id) = wheel_rpos;
}                                      /* End of function touch_wheel_decode() */

#endif

#if (TOUCH_CFG_PAD_ENABLE)

/***********************************************************************************************************************
 * Function Name: touch_pad_decode
 * Description  : Pad Decode function
 * Arguments    : touch_pad_info_t  p_pinfo : Pointer to Pad Information structure
 *              : uint16_t *wheel_data        : Pointer to Wheel data array
 *              : uint8_t  num_elements       : Number of element on wheel
 *              : uint8_t  wheel_id           : Wheel ID
 * Return Value : None
 ***********************************************************************************************************************/
void touch_pad_decode (touch_pad_info_t * p_pinfo, uint8_t num_x, uint8_t num_y, uint8_t max_touch)
{
    uint16_t i;
    uint16_t j;
    uint8_t  loop;
    uint16_t pitch_x;
    uint16_t pitch_y;
    uint16_t element_num;
    int32_t  max_diff;
    uint16_t max_x;
    uint16_t max_y;
    int32_t  x_parameter;
    int32_t  y_parameter;
    int16_t  heat_map[TOUCH_MAP_X * TOUCH_MAP_Y];
    uint8_t  use_map[TOUCH_MAP_X * TOUCH_MAP_Y];
    int32_t  tmp_heat;
    int32_t  tmp_x1;                   /* Work for calculating x parameter1 */
    int32_t  tmp_x2;                   /* Work for calculating x parameter2 */
    int32_t  tmp_x3;                   /* Work for calculating x parameter3 */
    int32_t  tmp_x4;                   /* Work for calculating x parameter4 */
    int32_t  tmp_y1;                   /* Work for calculating y parameter1 */
    int32_t  tmp_y2;                   /* Work for calculating y parameter2 */
    int32_t  tmp_y3;                   /* Work for calculating y parameter3 */
    int32_t  tmp_y4;                   /* Work for calculating y parameter4 */

    element_num = (uint16_t) (num_x * num_y);
    pitch_x     = (uint16_t) (*(p_pinfo->p_rx_pixel) / num_x);
    pitch_y     = (uint16_t) (*(p_pinfo->p_tx_pixel) / num_y);

    /* Get coordinate data for the Max touch */
    for (loop = 0; loop < max_touch; loop++)
    {
        /* initialize heat-map variables */
        max_diff = 0;
        max_y    = 0;
        max_x    = 0;

        /* Clear heat map ,and initial use map */
        for (i = 0; i < (TOUCH_MAP_X * TOUCH_MAP_Y); i++)
        {
            heat_map[i] = 0;
            use_map[i]  = 1;
        }

        /* Maximum value search */
        for (j = 0; j < num_x; j++)
        {
            for (i = 0; i < num_y; i++)
            {
                if (g_touch_pad_buf[element_num + j + (i * num_x)] > max_diff)
                {
                    max_diff = g_touch_pad_buf[element_num + j + (i * num_x)];
                    max_y    = i;
                    max_x    = j;
                }
            }
        }

        /* touch check */
        if (max_diff >= *(p_pinfo->p_threshold))
        {
            /* make use map */
            if (0 == max_y)
            {
                /* If map position is Top. */
                use_map[0] = 0;
                use_map[1] = 0;
                use_map[2] = 0;
            }
            else if ((num_y - 1) == max_y)
            {
                /* If map position is Bottom. */
                use_map[6] = 0;
                use_map[7] = 0;
                use_map[8] = 0;
            }
            else
            {
            }

            if (0 == max_x)
            {
                /* If map position is Left. */
                use_map[0] = 0;
                use_map[3] = 0;
                use_map[6] = 0;
            }
            else if ((num_x - 1) == max_x)
            {
                /* If map position is Right. */
                use_map[2] = 0;
                use_map[5] = 0;
                use_map[8] = 0;
            }
            else
            {
            }

            /* make heat mapping */
            for (i = 0; i < TOUCH_MAP_X; i++)
            {
                for (j = 0; j < TOUCH_MAP_Y; j++)
                {
                    if (use_map[j + (i * TOUCH_MAP_X)])
                    {
                        heat_map[j + (i * TOUCH_MAP_X)] =
                                g_touch_pad_buf[element_num + (max_x - 1 + j) + (max_y - 1 + i) * num_x];
                    }
                }
            }

            /* get x value */
            /* Calculate right + bottom value. (x1/y1) */
            tmp_heat = heat_map[5] + heat_map[7];
            if (tmp_heat == 0)
            {
                /* When dividing by zero, set the calculation result to zero */
                tmp_x1 = 0;                                      /* x parameter1 */
                tmp_y1 = 0;                                      /* y parameter1 */
            }
            else
            {
                tmp_x1 = (heat_map[8] * heat_map[5]) / tmp_heat; /* x parameter1 */
                tmp_y1 = (heat_map[8] * heat_map[7]) / tmp_heat; /* y parameter1 */
            }

            /* Calculate right + up value. (x2/y4) */
            tmp_heat = heat_map[5] + heat_map[1];
            if (tmp_heat == 0)
            {
                /* When dividing by zero, set the calculation result to zero */
                tmp_x2 = 0;                                      /* x parameter2 */
                tmp_y4 = 0;                                      /* y parameter4 */
            }
            else
            {
                tmp_x2 = (heat_map[2] * heat_map[5]) / tmp_heat; /* x parameter2 */
                tmp_y4 = (heat_map[2] * heat_map[1]) / tmp_heat; /* y parameter4 */
            }

            /* Calculate left + up value. (x3/y3) */
            tmp_heat = heat_map[3] + heat_map[1];
            if (tmp_heat == 0)
            {
                /* When dividing by zero, set the calculation result to zero */
                tmp_x3 = 0;                                      /* x parameter3 */
                tmp_y3 = 0;                                      /* y parameter3 */
            }
            else
            {
                tmp_x3 = (heat_map[0] * heat_map[3]) / tmp_heat; /* x parameter3 */
                tmp_y3 = (heat_map[0] * heat_map[1]) / tmp_heat; /* y parameter3 */
            }

            /* Calculate left + down value. (x4/y2) */
            tmp_heat = heat_map[3] + heat_map[7];
            if (tmp_heat == 0)
            {
                /* When dividing by zero, set the calculation result to zero */
                tmp_x4 = 0;                                      /* x parameter4 */
                tmp_y2 = 0;                                      /* y parameter2 */
            }
            else
            {
                tmp_x4 = (heat_map[6] * heat_map[3]) / tmp_heat; /* x parameter4 */
                tmp_y2 = (heat_map[6] * heat_map[7]) / tmp_heat; /* y parameter2 */
            }

            if (heat_map[4] == 0)
            {
                x_parameter = 0;
            }
            else
            {
                /* x coordinate value calculation*/
                x_parameter = ((pitch_x / 2) *
                               (heat_map[5] + tmp_x1 + tmp_x2 -
                                heat_map[3] - tmp_x3 - tmp_x4) /
                               heat_map[4]);
            }

            /* Fit to pitch */
            if (x_parameter > pitch_x / 2)
            {
                x_parameter = pitch_x / 2;
            }
            else if (x_parameter < -(pitch_x / 2))
            {
                x_parameter = -(pitch_x / 2);
            }
            else
            {
                /* no operation */
            }

