xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
            /* Coordinate x value based on pitch */
            *(p_pinfo->p_rx_coordinate + loop) =
                (uint16_t) ((pitch_x * (max_x + 1) - pitch_x / 2) + x_parameter);

            /* get y value */
            if (heat_map[4] == 0)
            {
                y_parameter = 0;
            }
            else
            {
                /* y coordinate value calculation*/
                y_parameter = ((pitch_y / 2) *
                               (heat_map[7] + tmp_y1 + tmp_y2 -
                                heat_map[1] - tmp_y3 - tmp_y4) /
                               heat_map[4]);
            }

            /* Fit to pitch */
            if (y_parameter > pitch_y / 2)
            {
                y_parameter = pitch_y / 2;
            }
            else if (y_parameter < -(pitch_y / 2))
            {
                y_parameter = -(pitch_y / 2);
            }
            else
            {
                /* no operation */
            }

            /* Coordinate y value based on pitch  */
            *(p_pinfo->p_tx_coordinate + loop) =
                (uint16_t) ((pitch_y * (max_y + 1) - pitch_y / 2) + y_parameter);

            /* If touching ,then counter increment */
            (*(p_pinfo->p_num_touch))++;

            /* Clear the processed heat map area */
            for (i = 0; i < TOUCH_MAP_X; i++)
            {
                for (j = 0; j < TOUCH_MAP_Y; j++)
                {
                    if (use_map[i * TOUCH_MAP_X + j])
                    {
                        g_touch_pad_buf[element_num + (max_x - 1 + j) + (max_y - 1 + i) * num_x] = 0;
                    }
                }
            }
        }
        else
        {
            *(p_pinfo->p_rx_coordinate + loop) = TOUCH_OFF_VALUE;
            *(p_pinfo->p_tx_coordinate + loop) = TOUCH_OFF_VALUE;
        }
    }
}

#endif

#if ((TOUCH_CFG_MONITOR_ENABLE && (TOUCH_CFG_UART_MONITOR_SUPPORT == 1)) || TOUCH_CFG_UART_TUNING_SUPPORT == 1)

/***********************************************************************************************************************
 * Function Name: user_uart_qe_callback
 * Description  : QE UART callback function
 * Arguments    : uart_callback_args_t * p_args : callback parameters
 * Return Value : None
 ***********************************************************************************************************************/
void touch_uart_callback (void *pargs)
{
    sci_cb_args_t   *args;
    uint16_t index;

 #if (TOUCH_CFG_MONITOR_ENABLE && (TOUCH_CFG_UART_MONITOR_SUPPORT == 1))
    ctsu_instance_ctrl_t * p_ctsu_ctrl;
    uint16_t               write_data;
    uint16_t               ctsuso;
    uint8_t                ctsusdpa;
    uint8_t                ctsusnum;
  #if (BSP_FEATURE_CTSU_VERSION == 2)
    uint32_t * p_ctsuso;
    uint32_t * p_ctsusdpa;
    uint32_t * p_ctsusnum;
  #endif
  #if (BSP_FEATURE_CTSU_VERSION == 1)
    uint16_t * p_ctsuso;
    uint16_t * p_ctsusdpa;
    uint16_t * p_ctsusnum;
  #endif
    uint8_t num;
    uint8_t element;
 #endif

 #if (TOUCH_CFG_UART_TUNING_SUPPORT == 1)
    touch_instance_ctrl_t * p_instance_ctrl = gp_touch_isr_context;
    uint16_t                element_id;
    uint8_t               * port_adress_8;
    uint16_t              * port_adress_16;
    uint32_t              * port_adress_32;
    uint8_t                 write_byte;
 #endif

    args = (sci_cb_args_t *)pargs;

    if (args->event == SCI_EVT_TEI)
    {
        g_touch_uart_transmit_flag = 0;

        return;
    }

    if (args->event == SCI_EVT_RX_CHAR)
    {
        g_receive_intterupt_count++;
    }

#if ((TOUCH_CFG_MONITOR_ENABLE &&(TOUCH_CFG_UART_MONITOR_SUPPORT == 1)) || (TOUCH_CFG_UART_TUNING_SUPPORT == 1))

    if ((args->event == SCI_EVT_RX_CHAR) && (TOUCH_TUNING_COMMAND_BUF_NUM ==  g_receive_intterupt_count))
    {
        /* Restart reception */
        R_SCI_Receive(g_touch_uart_control, &g_touch_uart_rx_buf[0] ,TOUCH_TUNING_COMMAND_BUF_NUM);

        g_touch_uart_command_top = g_touch_uart_rx_buf[1] >> 4;

 #if (TOUCH_CFG_UART_TUNING_SUPPORT == 1)
        /* Reconnection due to UART baud rate difference. */
        if (TOUCH_TUNING_HEADER != g_touch_uart_rx_buf[0])
        {
            g_touch_uart_baudrate_err_flag = 1;
            g_receive_intterupt_count = 0;
        }
 #endif
        return;
    }

#endif

#if (TOUCH_CFG_MONITOR_ENABLE &&(TOUCH_CFG_UART_MONITOR_SUPPORT == 1))
    if ((g_touch_uart_command_top == TOUCH_UART_COMMAND_TOP_NUM) &&
            (args->event == SCI_EVT_RX_CHAR) &&
            (TOUCH_UART_RECIEVE_BUF_SIZE ==  g_receive_intterupt_count))
    {
        /* Restart reception */
        R_SCI_Receive(g_touch_uart_control,
                &g_touch_uart_rx_buf[TOUCH_TUNING_COMMAND_BUF_NUM] ,
                (TOUCH_UART_RECIEVE_BUF_SIZE - TOUCH_TUNING_COMMAND_BUF_NUM));
        g_receive_intterupt_count = 0;

        if (1 == g_touch_uart_transmit_flag)
        {
            g_touch_uart_transmit_flag = 0;
        }

        /* Set fixed header */
        g_touch_monitor_buf[0] = TOUCH_UART_HEADER;

        /* Create response command */
        if ((g_touch_uart_rx_buf[0] == TOUCH_UART_HEADER) && (g_touch_uart_rx_buf[12] == TOUCH_UART_FOOTER))
        {
            g_touch_monitor_buf[1] = g_touch_uart_rx_buf[1] | TOUCH_UART_RESPONSE_BIT;
        }
        else
        {
            g_touch_monitor_buf[1] = g_touch_uart_rx_buf[1] | TOUCH_UART_RESPONSE_ERROR_BIT;
            g_touch_uart_rx_buf[1] = g_touch_monitor_buf[1];
        }

        /* Set same ID */
        g_touch_monitor_buf[4] = g_touch_uart_rx_buf[4];

        /* Set index, Fixed data up to index 4. After index 5, it depends on the command. */
        index = 5;

        if (g_touch_uart_rx_buf[1] == TOUCH_UART_COMMAND_START)
        {
            num = g_touch_uart_rx_buf[5];
            if (0 == (((uint32_t) 1 << num) & g_touch_uart_open_bitmap))
            {
                /* Unopened methods generate errors */
                g_touch_monitor_buf[1] = g_touch_uart_rx_buf[1] | TOUCH_UART_RESPONSE_ERROR_BIT;
            }
            else
            {
                g_touch_uart_monitor_num = num;
            }

