xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
            g_touch_monitor_buf[index++] = (uint8_t) g_touch_uart_open_bitmap;
            g_touch_monitor_buf[index++] = (uint8_t) (g_touch_uart_open_bitmap >> 8);
            g_touch_monitor_buf[index++] = (uint8_t) (g_touch_uart_open_bitmap >> 16);
            g_touch_monitor_buf[index++] = (uint8_t) (g_touch_uart_open_bitmap >> 24);
        }
        else if (g_touch_uart_rx_buf[1] == TOUCH_UART_COMMAND_STOP)
        {
            g_touch_uart_monitor_num = TOUCH_UART_MONITOR_NONE;
        }
        else if ((g_touch_uart_rx_buf[1] == TOUCH_UART_COMMAND_READ) ||
                 (g_touch_uart_rx_buf[1] == TOUCH_UART_COMMAND_WRITE))
        {
            num     = g_touch_uart_rx_buf[5];
            element = g_touch_uart_rx_buf[7];

            if (0 == (((uint32_t) 1 << num) & g_touch_uart_open_bitmap))
            {
                /* Unopened methods generate errors */
                g_touch_monitor_buf[1] = g_touch_uart_rx_buf[1] | TOUCH_UART_RESPONSE_ERROR_BIT;
            }
            else
            {
                p_ctsu_ctrl = (ctsu_instance_ctrl_t *) gp_touch_ctrl_list[num]->p_ctsu_instance->p_ctrl;
  #if (BSP_FEATURE_CTSU_VERSION == 2)
                p_ctsuso   = &(p_ctsu_ctrl->p_ctsuwr[element].ctsuso);
                p_ctsusnum = &(p_ctsu_ctrl->p_ctsuwr[element].ctsuso);
                p_ctsusdpa = &(p_ctsu_ctrl->p_ctsuwr[element].ctsuso);
  #endif
  #if (BSP_FEATURE_CTSU_VERSION == 1)
                p_ctsuso   = &(p_ctsu_ctrl->p_ctsuwr[element].ctsuso0);
                p_ctsusnum = &(p_ctsu_ctrl->p_ctsuwr[element].ctsuso0);
                p_ctsusdpa = &(p_ctsu_ctrl->p_ctsuwr[element].ctsuso1);
  #endif
                ctsuso   = (uint16_t) (*p_ctsuso & TOUCH_UART_CTSUSO_MASK);
                ctsusnum = (uint8_t) ((*p_ctsusnum >> TOUCH_UART_CTSUSNUM_SHIFT) & TOUCH_UART_CTSUSNUM_MASK);
                ctsusdpa = (uint8_t) ((*p_ctsusdpa >> TOUCH_UART_CTSUSDPA_SHIFT) & TOUCH_UART_CTSUSDPA_MASK);
                if (g_touch_uart_rx_buf[1] == TOUCH_UART_COMMAND_READ)
                {
                    /* Drift Correction */
                    g_touch_monitor_buf[index++] = (uint8_t) (gp_touch_ctrl_list[num]->binfo.drift_freq);
                    g_touch_monitor_buf[index++] = (uint8_t) (gp_touch_ctrl_list[num]->binfo.drift_freq >> 8);

                    /* Long Press Cancel */
                    g_touch_monitor_buf[index++] = (uint8_t) (gp_touch_ctrl_list[num]->binfo.cancel_freq);
                    g_touch_monitor_buf[index++] = (uint8_t) (gp_touch_ctrl_list[num]->binfo.cancel_freq >> 8);

                    /* Positive Noise Filter */
                    g_touch_monitor_buf[index++] = gp_touch_ctrl_list[num]->binfo.on_freq;
                    g_touch_monitor_buf[index++] = 0x00;

                    /* Negative Noise Filter */
                    g_touch_monitor_buf[index++] = gp_touch_ctrl_list[num]->binfo.off_freq;
                    g_touch_monitor_buf[index++] = 0x00;

                    /* Depth of Moving Average Filter */
                    g_touch_monitor_buf[index++] = (uint8_t) (p_ctsu_ctrl->num_moving_average);
                    g_touch_monitor_buf[index++] = (uint8_t) (p_ctsu_ctrl->num_moving_average >> 8);

                    /* CTSUSO (element) */
                    g_touch_monitor_buf[index++] = (uint8_t) (ctsuso);
                    g_touch_monitor_buf[index++] = (uint8_t) (ctsuso >> 8);

                    /* CTSUSNUM (element) */
                    g_touch_monitor_buf[index++] = ctsusnum;

                    /* CTSUSDPA (element) */
                    g_touch_monitor_buf[index++] = ctsusdpa;
                }
                else
                {
                    /* Write Action */
                    write_data =
                        (uint16_t) (((uint16_t) g_touch_uart_rx_buf[9] << 8) | (uint16_t) g_touch_uart_rx_buf[8]);
                    switch (g_touch_uart_rx_buf[6]) /* data type */
                    {
                        case TOUCH_UART_WRITE_DRIFT:
                        {
                            gp_touch_ctrl_list[num]->binfo.drift_freq = write_data;
                            break;
                        }

                        case TOUCH_UART_WRITE_CANCEL:
                        {
                            gp_touch_ctrl_list[num]->binfo.cancel_freq = write_data;
                            break;
                        }

                        case TOUCH_UART_WRITE_POSITIVE:
                        {
                            gp_touch_ctrl_list[num]->binfo.on_freq = (uint8_t) write_data;
                            break;
                        }

                        case TOUCH_UART_WRITE_NEGATIVE:
                        {
                            gp_touch_ctrl_list[num]->binfo.off_freq = (uint8_t) write_data;
                            break;
                        }

                        case TOUCH_UART_WRITE_MOVING_AVG:
                        {
                            p_ctsu_ctrl->num_moving_average = write_data;
                            break;
                        }

                        case TOUCH_UART_WRITE_THRESHOLD:
                        {
                            gp_touch_ctrl_list[num]->binfo.p_threshold[element] = write_data;
                            break;
                        }

                        case TOUCH_UART_WRITE_HYSTERESIS:
                        {
                            gp_touch_ctrl_list[num]->binfo.p_hysteresis[element] = write_data;
                            break;
                        }

                        case TOUCH_UART_WRITE_THRESH_SLDR:
                        {
                            gp_touch_ctrl_list[num]->sinfo.p_threshold[element] = write_data;
                            break;
                        }

                        case TOUCH_UART_WRITE_THRESH_WHEL:
                        {
                            gp_touch_ctrl_list[num]->winfo.p_threshold[element] = write_data;
                            break;
                        }

