xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
                        case TOUCH_UART_WRITE_CTSUSO:
                        {
  #if (BSP_FEATURE_CTSU_VERSION == 2)
                            *p_ctsuso &= (uint32_t) (~TOUCH_UART_CTSUSO_MASK);
                            *p_ctsuso |= write_data;
  #endif
  #if (BSP_FEATURE_CTSU_VERSION == 1)
                            *p_ctsuso &= (uint16_t) (~TOUCH_UART_CTSUSO_MASK);
                            *p_ctsuso |= write_data;
  #endif
                            break;
                        }

                        case TOUCH_UART_WRITE_CTSUSNUM:
                        {
  #if (BSP_FEATURE_CTSU_VERSION == 2)
                            *p_ctsusnum &= (~((uint32_t) TOUCH_UART_CTSUSNUM_MASK << TOUCH_UART_CTSUSNUM_SHIFT));
                            *p_ctsusnum |= ((uint32_t) write_data << TOUCH_UART_CTSUSNUM_SHIFT);
  #endif
  #if (BSP_FEATURE_CTSU_VERSION == 1)
                            *p_ctsusnum &= (uint16_t) (~(TOUCH_UART_CTSUSNUM_MASK << TOUCH_UART_CTSUSNUM_SHIFT));
                            *p_ctsusnum |= (uint16_t) (write_data << TOUCH_UART_CTSUSNUM_SHIFT);
  #endif
                            break;
                        }

                        case TOUCH_UART_WRITE_CTSUSDPA:
                        {
  #if (BSP_FEATURE_CTSU_VERSION == 2)
                            *p_ctsusdpa &= (~((uint32_t) TOUCH_UART_CTSUSDPA_MASK << TOUCH_UART_CTSUSDPA_SHIFT));
                            *p_ctsusdpa |= ((uint32_t) write_data << TOUCH_UART_CTSUSDPA_SHIFT);
  #endif
  #if (BSP_FEATURE_CTSU_VERSION == 1)
                            *p_ctsusdpa &= (uint16_t) (~(TOUCH_UART_CTSUSDPA_MASK << TOUCH_UART_CTSUSDPA_SHIFT));
                            *p_ctsusdpa |= (uint16_t) (write_data << TOUCH_UART_CTSUSDPA_SHIFT);
  #endif
                            break;
                        }

  #if (TOUCH_CFG_PAD_ENABLE)

                        /* write command */
                        case TOUCH_UART_WRTIE_PAD_THRESHOLD:
                        {
                            *gp_touch_ctrl_list[num]->pinfo.p_threshold = write_data;
                            break;
                        }

                        case TOUCH_UART_WRTIE_PAD_RX_PIXEL:
                        {
                            *gp_touch_ctrl_list[num]->pinfo.p_rx_pixel = write_data;
                            break;
                        }

                        case TOUCH_UART_WRTIE_PAD_TX_PIXEL:
                        {
                            *gp_touch_ctrl_list[num]->pinfo.p_tx_pixel = write_data;
                            break;
                        }

                        case TOUCH_UART_WRTIE_PAD_MAX_TOUCH:
                        {
                            *gp_touch_ctrl_list[num]->pinfo.p_max_touch = (uint8_t) write_data;
                            break;
                        }

                        case TOUCH_UART_WRTIE_PAD_DRIFT:
                        {
                            gp_touch_ctrl_list[num]->pinfo.num_drift = (uint8_t) write_data;
                            break;
                        }
  #endif                               /* TOUCH_CFG_PAD_ENABLE */
                        default:
                        {
                            break;
                        }
                    }
                }
            }
        }
        else if (g_touch_uart_rx_buf[1] == TOUCH_UART_COMMAND_VERSION)
        {
            g_touch_monitor_buf[index++] = TOUCH_UART_VERSION_MINOR;
            g_touch_monitor_buf[index++] = TOUCH_UART_VERSION_MAJOR;
        }
        else
        {
        }

        /* Set fixed footer */
        g_touch_monitor_buf[index++] = TOUCH_UART_FOOTER;

        /* Set data size */
        g_touch_monitor_buf[2] = (uint8_t) index;
        g_touch_monitor_buf[3] = (uint8_t) (index >> 8);

        /* Start transmission */
        g_touch_uart_transmit_flag = 1;
        R_SCI_Send(g_touch_uart_control, &g_touch_monitor_buf[0] ,index);
        return;
    }
 #endif

#if (TOUCH_CFG_UART_TUNING_SUPPORT == 1)
    if ((g_touch_uart_command_top == TOUCH_TUNING_COMMAND_TOP_NUM) &&
            (args->event == SCI_EVT_RX_CHAR) &&
            (TOUCH_TUNING_RECIEVE_BUF_SIZE ==  g_receive_intterupt_count))
    {
        /* Restart reception */
        R_SCI_Receive(g_touch_uart_control,
                &g_touch_uart_rx_buf[TOUCH_TUNING_COMMAND_BUF_NUM] ,
                (TOUCH_TUNING_RECIEVE_BUF_SIZE - TOUCH_TUNING_COMMAND_BUF_NUM));
        g_receive_intterupt_count = 0;

        if (1 == g_touch_uart_transmit_flag)
        {
            g_touch_uart_transmit_flag = 0;
        }

        /* Set fixed header */
        g_touch_tuning_tx_buf[0] = TOUCH_TUNING_HEADER;

        /* Create response command */
        if ((g_touch_uart_rx_buf[0] == TOUCH_TUNING_HEADER) && (g_touch_uart_rx_buf[14] == TOUCH_TUNING_FOOTER))
        {
            g_touch_tuning_tx_buf[1] = (uint8_t) (g_touch_uart_rx_buf[1] + TOUCH_TUNING_RESPONSE_BIT);
        }
        else
        {
            g_touch_tuning_tx_buf[1] = (uint8_t) (g_touch_uart_rx_buf[1] + TOUCH_TUNING_RESPONSE_ERROR_BIT);
            g_touch_uart_rx_buf[1]   = g_touch_tuning_tx_buf[1];
        }

        /* Set same ID */
        g_touch_tuning_tx_buf[4] = g_touch_uart_rx_buf[4];

        /* Set index, Fixed data up to index 4. After index 5, it depends on the command. */
        index = 5;

        /* Run command */
        if (g_touch_uart_rx_buf[1] == TOUCH_TUNING_COMMAND_START)
        {
            /* Data length */
            g_touch_tuning_tx_buf[2]              = 0x6;
            g_touch_tuning_tx_buf[3]              = 0x0;
            p_instance_ctrl->serial_tuning_enable = true;
            ctsu_instance_ctrl_t * p_ctsu_instance_ctrl =
                (ctsu_instance_ctrl_t *) p_instance_ctrl->p_ctsu_instance->p_ctrl;
            p_ctsu_instance_ctrl->serial_tuning_enable = true;
            g_touch_tuning_mode = TOUCH_TUNING_MODE_START;
        }
        else if (g_touch_uart_rx_buf[1] == TOUCH_TUNING_COMMAND_STOP)
        {
            /* Data length */
            g_touch_tuning_tx_buf[2] = 0x6;
            g_touch_tuning_tx_buf[3] = 0x0;

            p_instance_ctrl->serial_tuning_enable = false;
            ctsu_instance_ctrl_t * p_ctsu_instance_ctrl =
                (ctsu_instance_ctrl_t *) p_instance_ctrl->p_ctsu_instance->p_ctrl;
            p_ctsu_instance_ctrl->serial_tuning_enable = false;
            g_touch_tuning_mode = TOUCH_TUNING_MODE_FINISH;
        }
        else if (g_touch_uart_rx_buf[1] == TOUCH_TUNING_COMMAND_VARIABLE_WRITE)
        {
            /* Data length */
            g_touch_tuning_tx_buf[2] = 0x6;
            g_touch_tuning_tx_buf[3] = 0x0;

            switch (g_touch_uart_rx_buf[5]) /* data type */
            {
                case TOUCH_TUNING_VARIABLE_MCU_GROUP:
                {
                    touch_tuning_get8((uint8_t *) &g_touch_tuning_mcu_group, 7);
                    break;
                }

