xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
                case TOUCH_TUNING_VARIABLE_PCLKB_FREQUENCY:
                {
                    touch_tuning_get32((uint32_t *) &g_touch_tuning_pclkb_frequency, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_TUNING_MODE:
                {
                    touch_tuning_get8((uint8_t *) &g_touch_tuning_mode, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_STATE:
                {
                    touch_tuning_get8((uint8_t *) &g_touch_tuning_state, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_SCAN_MODE:
                {
                    touch_tuning_get8((uint8_t *) &g_touch_tuning_scan_mode, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_TS_CHAC_MASK_BOTTOM:
                {
                    touch_tuning_get32(&g_touch_tuning_ts_chac_mask.mska, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_TS_CHAC_MASK_TOP:
                {
                    touch_tuning_get32(&g_touch_tuning_ts_chac_mask.mskb, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_TS_CHTRC_MASK_BOTTOM:
                {
                    touch_tuning_get32(&g_touch_tuning_ts_chtrc_mask.mska, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_TS_CHTRC_MASK_TOP:
                {
                    touch_tuning_get32(&g_touch_tuning_ts_chtrc_mask.mskb, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_QE_TXVSEL:
                {
                    touch_tuning_get8((uint8_t *) &g_touch_tuning_qe_txvsel, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_QE_ATUNE:
                {
                    touch_tuning_get8((uint8_t *) &g_touch_tuning_qe_atune, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_QE_POSEL:
                {
                    touch_tuning_get8((uint8_t *) &g_touch_tuning_qe_posel, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_ERR_EVENT:
                {
                    touch_tuning_get8((uint8_t *) &g_touch_tuning_err_event, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_ICO_DATA_PRI:
                {
                    element_id = g_touch_uart_rx_buf[6];
                    if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode_save)
                    {
                        touch_tuning_get16(&g_touch_tuning_ico_data[element_id], 7);
                    }
                    else
                    {
                        if (TOUCH_TUNING_SCAN_SELF == g_touch_tuning_scan_mode)
                        {
                            touch_tuning_get16(&g_touch_tuning_ico_data[element_id], 7);
                        }
                        else if (TOUCH_TUNING_SCAN_MUTUAL == g_touch_tuning_scan_mode)
                        {
                            touch_tuning_get16(&g_touch_tuning_ico_data[element_id * 2], 7);
                        }

  #if (BSP_FEATURE_CTSU_VERSION == 2)
   #if (CTSU_CFG_NUM_CFC != 0)
                        else if (TOUCH_TUNING_SCAN_MUTUAL_CFC == g_touch_tuning_scan_mode)
                        {
                            touch_tuning_get16(&g_touch_tuning_ico_data[element_id * 2], 7);
                        }
   #endif
  #endif
                        else
                        {
                        }
                    }

                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_ICO_DATA_SND:
                {
                    element_id = g_touch_uart_rx_buf[6];
                    touch_tuning_get16(&g_touch_tuning_ico_data[element_id * 2 + 1], 7);
                    break;
                }

  #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
                case TOUCH_TUNING_VARIABLE_CTSU_MUTUAL_DATA:
                {
                    element_id = g_touch_uart_rx_buf[6];
                    touch_tuning_get16(&g_touch_tuning_mutual_data[element_id], 7);
                    break;
                }
  #endif

  #if (BSP_FEATURE_CTSU_VERSION == 2)
                case TOUCH_TUNING_VARIABLE_ELEMENT_CFGS_SO:
                {
                    element_id = g_touch_uart_rx_buf[6];
                    touch_tuning_get16(&g_touch_tuning_element_cfgs[element_id].so, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_ELEMENT_CFGS_SNUM:
                {
                    element_id = g_touch_uart_rx_buf[6];
                    touch_tuning_get8(&g_touch_tuning_element_cfgs[element_id].snum, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_ELEMENT_CFGS_SDPA:
                {
                    element_id = g_touch_uart_rx_buf[6];
                    touch_tuning_get8(&g_touch_tuning_element_cfgs[element_id].sdpa, 7);
                    break;
                }
  #endif

  #if (BSP_FEATURE_CTSU_VERSION == 1)
                case TOUCH_TUNING_VARIABLE_CTSU_WRITE_SSC:
                {
                    element_id = g_touch_uart_rx_buf[6];
                    touch_tuning_get16(&g_touch_tuning_ctsu_write[element_id].ctsussc, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_WRITE_SO0:
                {
                    element_id = g_touch_uart_rx_buf[6];
                    touch_tuning_get16(&g_touch_tuning_ctsu_write[element_id].ctsuso0, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_WRITE_SO1:
                {
                    element_id = g_touch_uart_rx_buf[6];
                    touch_tuning_get16(&g_touch_tuning_ctsu_write[element_id].ctsuso1, 7);
                    break;
                }
  #endif
                case TOUCH_TUNING_VARIABLE_SELF_TARGET_VALUE:
                {
                    touch_tuning_get16(&g_touch_tuning_self_target_value, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_MUTUAL_TARGET_VALUE:
                {
                    touch_tuning_get16(&g_touch_tuning_mutual_target_value, 7);
                    break;
                }
   #if (BSP_FEATURE_CTSU_VERSION == 2)
    #if (CTSU_CFG_MULTIPLE_ELECTRODE_CONNECTION_ENABLE == 1)
                case TOUCH_TUNING_VARIABLE_QE_TSOD:
                {
                    touch_tuning_get8((uint8_t *)&g_touch_tuning_qe_tsod, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_QE_MEC_TS:
                {
                    touch_tuning_get8((uint8_t *)&g_touch_tuning_qe_mec_ts, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_QE_MEC_SHIELD_TS :
                {
                    touch_tuning_get8((uint8_t *)&g_touch_tuning_qe_mec_shield_ts, 7);
                    break;
                }
    #endif
   #endif

                default:
                {
                    break;
                }
            }
        }
        else if (g_touch_uart_rx_buf[1] == TOUCH_TUNING_COMMAND_VARIABLE_READ)
        {
            /* Data length */
            g_touch_tuning_tx_buf[2] = 0xC;
            g_touch_tuning_tx_buf[3] = 0x0;

            index = 11;

            g_touch_tuning_tx_buf[5] = g_touch_uart_rx_buf[5];

            switch (g_touch_uart_rx_buf[5]) /* data type */
            {
                case TOUCH_TUNING_VARIABLE_MCU_GROUP:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send8(g_touch_tuning_mcu_group, 7);
                    break;
                }

