xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
                case TOUCH_TUNING_VARIABLE_PCLKB_FREQUENCY:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send32(g_touch_tuning_pclkb_frequency, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_TUNING_MODE:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send8((uint8_t) g_touch_tuning_mode, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_STATE:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send8((uint8_t) g_touch_tuning_state, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_SCAN_MODE:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send8((uint8_t) g_touch_tuning_scan_mode, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_TS_CHAC_MASK_BOTTOM:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send32(g_touch_tuning_ts_chac_mask.mska, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_TS_CHAC_MASK_TOP:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send32(g_touch_tuning_ts_chac_mask.mskb, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_TS_CHTRC_MASK_BOTTOM:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send32(g_touch_tuning_ts_chtrc_mask.mska, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_TS_CHTRC_MASK_TOP:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send32(g_touch_tuning_ts_chtrc_mask.mskb, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_QE_TXVSEL:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send8(g_touch_tuning_qe_txvsel, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_QE_ATUNE:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send8((uint8_t) g_touch_tuning_qe_atune, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_QE_POSEL:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send8((uint8_t) g_touch_tuning_qe_posel, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_ERR_EVENT:
                {
                    g_touch_tuning_tx_buf[6] = 0;
                    touch_tuning_send8((uint8_t) g_touch_tuning_err_event, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_ICO_DATA_PRI:
                {
                    g_touch_tuning_tx_buf[5] = TOUCH_TUNING_VARIABLE_CTSU_ICO_DATA_PRI;
                    element_id               = g_touch_uart_rx_buf[6];
                    if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode_save)
                    {
                        g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                        touch_tuning_send16(g_touch_tuning_ico_data[element_id], 7);
                    }
                    else
                    {
                        if (TOUCH_TUNING_SCAN_SELF == g_touch_tuning_scan_mode)
                        {
                            g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                            touch_tuning_send16(g_touch_tuning_ico_data[element_id], 7);
                        }
                        else if (TOUCH_TUNING_SCAN_MUTUAL == g_touch_tuning_scan_mode)
                        {
                            g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                            touch_tuning_send16(g_touch_tuning_ico_data[element_id * 2], 7);
                        }

  #if (BSP_FEATURE_CTSU_VERSION == 2)
   #if (CTSU_CFG_NUM_CFC != 0)
                        else if (TOUCH_TUNING_SCAN_MUTUAL_CFC == g_touch_tuning_scan_mode)
                        {
                            g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                            touch_tuning_send16(g_touch_tuning_ico_data[element_id * 2], 7);
                        }
   #endif
  #endif
                        else
                        {
                        }
                    }

                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_ICO_DATA_SND:
                {
                    element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send32(g_touch_tuning_ico_data[element_id * 2 + 1], 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_MUTUAL_DATA:
                {
                    element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
  #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
                    touch_tuning_send32(g_touch_tuning_mutual_data[element_id], 7);
  #endif
                    break;
                }

  #if (BSP_FEATURE_CTSU_VERSION == 2)
                case TOUCH_TUNING_VARIABLE_ELEMENT_CFGS_SO:
                {
                    element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send16(g_touch_tuning_element_cfgs[element_id].so, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_ELEMENT_CFGS_SNUM:
                {
                    element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send8(g_touch_tuning_element_cfgs[element_id].snum, 7);
                    break;
                }

