xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
                case TOUCH_TUNING_VARIABLE_ELEMENT_CFGS_SDPA:
                {
                    g_touch_tuning_tx_buf[5] = TOUCH_TUNING_VARIABLE_ELEMENT_CFGS_SDPA;
                    element_id               = g_touch_uart_rx_buf[6];

                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send8(g_touch_tuning_element_cfgs[element_id].sdpa, 7);
                    break;
                }
  #endif
  #if (BSP_FEATURE_CTSU_VERSION == 1)
                case TOUCH_TUNING_VARIABLE_CTSU_WRITE_SSC:
                {
                    element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send16(g_touch_tuning_ctsu_write[element_id].ctsussc, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_WRITE_SO0:
                {
                    element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send16(g_touch_tuning_ctsu_write[element_id].ctsuso0, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_CTSU_WRITE_SO1:
                {
                    element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send16(g_touch_tuning_ctsu_write[element_id].ctsuso1, 7);
                    break;
                }
  #endif
                case TOUCH_TUNING_VARIABLE_SELF_TARGET_VALUE:
                {
                    element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send16(g_touch_tuning_self_target_value, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_MUTUAL_TARGET_VALUE:
                {
                    element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send16(g_touch_tuning_mutual_target_value, 7);
                    break;
                }

   #if (BSP_FEATURE_CTSU_VERSION == 2)
    #if (CTSU_CFG_MULTIPLE_ELECTRODE_CONNECTION_ENABLE == 1)
                case TOUCH_TUNING_VARIABLE_QE_TSOD:
                {
                    element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send8(g_touch_tuning_qe_tsod, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_QE_MEC_TS:
                {
                    element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send8((uint8_t )g_touch_tuning_qe_mec_ts, 7);
                    break;
                }

                case TOUCH_TUNING_VARIABLE_QE_MEC_SHIELD_TS :
                {
                     element_id               = g_touch_uart_rx_buf[6];
                    g_touch_tuning_tx_buf[6] = (uint8_t) element_id;
                    touch_tuning_send8((uint8_t )g_touch_tuning_qe_mec_shield_ts, 7);
                    break;
                }
    #endif
   #endif
                default:
                {
                    break;
                }
            }
        }
        else if (g_touch_uart_rx_buf[1] == TOUCH_TUNING_COMMAND_ADDRESS_WRITE)
        {
            index = 5;

            write_byte = g_touch_uart_rx_buf[9];

            if (1 == write_byte)
            {
                port_adress_8 = (uint8_t *) (g_touch_uart_rx_buf[5] |
                                             (g_touch_uart_rx_buf[6] << 8) |
                                             (g_touch_uart_rx_buf[7] << 16) |
                                             (g_touch_uart_rx_buf[8] << 24));

                (*port_adress_8) |= (g_touch_uart_rx_buf[10]);
            }
            else if (2 == write_byte)
            {
                port_adress_16 = (uint16_t *) (g_touch_uart_rx_buf[5] |
                                               (g_touch_uart_rx_buf[6] << 8) |
                                               (g_touch_uart_rx_buf[7] << 16) |
                                               (g_touch_uart_rx_buf[8] << 24));

                (*port_adress_16) |= (uint16_t) (g_touch_uart_rx_buf[10] |
                                                 (g_touch_uart_rx_buf[11] << 8));
            }
            else
            {
                port_adress_32 = (uint32_t *) (g_touch_uart_rx_buf[5] |
                                               (g_touch_uart_rx_buf[6] << 8) |
                                               (g_touch_uart_rx_buf[7] << 16) |
                                               (g_touch_uart_rx_buf[8] << 24));

                (*port_adress_32) |= (uint32_t) (g_touch_uart_rx_buf[10] |
                                                 (g_touch_uart_rx_buf[11] << 8) |
                                                 (g_touch_uart_rx_buf[12] << 16) |
                                                 (g_touch_uart_rx_buf[13] << 24));
            }
        }
        else if (g_touch_uart_rx_buf[1] == TOUCH_TUNING_COMMAND_ADDRESS_READ)
        {
            index = 10;

            write_byte = g_touch_uart_rx_buf[9];

            if (1 == write_byte)
            {
                port_adress_8 = (uint8_t *) (g_touch_uart_rx_buf[5] |
                                             (g_touch_uart_rx_buf[6] << 8) |
                                             (g_touch_uart_rx_buf[7] << 16) |
                                             (g_touch_uart_rx_buf[8] << 24));

                touch_tuning_send8((*port_adress_8), 6);
            }
            else if (2 == write_byte)
            {
                port_adress_16 = (uint16_t *) (g_touch_uart_rx_buf[5] |
                                               (g_touch_uart_rx_buf[6] << 8) |
                                               (g_touch_uart_rx_buf[7] << 16) |
                                               (g_touch_uart_rx_buf[8] << 24));

                touch_tuning_send16((*port_adress_16), 6);
            }
            else
            {
                port_adress_32 = (uint32_t *) (g_touch_uart_rx_buf[5] |
                                               (g_touch_uart_rx_buf[6] << 8) |
                                               (g_touch_uart_rx_buf[7] << 16) |
                                               (g_touch_uart_rx_buf[8] << 24));

                touch_tuning_send32((*port_adress_32), 6);
            }
        }
        else if (g_touch_uart_rx_buf[1] == TOUCH_TUNING_COMMAND_PHASE_RUN)
        {
            g_touch_tuning_phase_run = 1;
        }
        else if (g_touch_uart_rx_buf[1] == TOUCH_TUNING_COMMAND_VERSION)
        {
            g_touch_tuning_tx_buf[index++] = 1;
            g_touch_tuning_tx_buf[index++] = 1;
        }
        else
        {
        }

