xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
        /* Set fixed footer */
        g_touch_tuning_tx_buf[index++] = TOUCH_TUNING_FOOTER;

        /* Set data size */
        g_touch_tuning_tx_buf[2] = (uint8_t) index;
        g_touch_tuning_tx_buf[3] = (uint8_t) (index >> 8);

        /* Start transmission */
        g_touch_uart_transmit_flag = 1;
        R_SCI_Send(g_touch_uart_control, &g_touch_tuning_tx_buf[0] ,index);
        return;
    }
 #endif

    /* End user code. Do not edit comment generated here */
}

#endif

#if (TOUCH_CFG_UART_TUNING_SUPPORT == 1)
void touch_serial_tuning (touch_instance_ctrl_t * const p_instance_ctrl)
{
    /* init tuning state */
    g_touch_tuning_state = TOUCH_TUNING_STATE_RESET;

    /* connect QE with UART */
    touch_tuning_uart_connect();

    touch_tuning_open(p_instance_ctrl);

    while (1U)
    {
        switch (g_touch_tuning_mode)
        {
            case TOUCH_TUNING_MODE_CORRECTION_1ST_VALUE:
            {
                switch (g_touch_tuning_state)
                {
                    case TOUCH_TUNING_STATE_RESET:
                    {
                        break;
                    }

                    case TOUCH_TUNING_STATE_INITIALIZE:
                    {
                        if (1 == g_touch_tuning_phase_run)
                        {
                            g_touch_tuning_mode_save = g_touch_tuning_mode;
 #if (BSP_FEATURE_CTSU_VERSION == 1)
                            touch_tuning_pclkb_get(&g_touch_tuning_pclkb_frequency);
 #endif
                            g_touch_tuning_phase_run = 0;
                            g_touch_tuning_state     = TOUCH_TUNING_STATE_COMPLETE;
                        }

                        break;
                    }

                    case TOUCH_TUNING_STATE_SCAN:
                    {
                        break;
                    }

                    case TOUCH_TUNING_STATE_COMPLETE:
                    {
                        g_touch_tuning_mode  = TOUCH_TUNING_MODE_QE_WATTING;
                        g_touch_tuning_state = TOUCH_TUNING_STATE_STOP;
                        break;
                    }

                    case TOUCH_TUNING_STATE_STOP:
                    {
                        break;
                    }
                }

                break;
            }

            case TOUCH_TUNING_MODE_CORRECTION_2ND_VALUE:
            {
                /* TOUCH_TUNING_MODE_CORRECTION_2ND_VALUE does not have this part of processing  */
                break;
            }

            case TOUCH_TUNING_MODE_MEASURE_PHASE1:
            {
                switch (g_touch_tuning_state)
                {
                    case TOUCH_TUNING_STATE_RESET:
                    {
                        break;
                    }

                    case TOUCH_TUNING_STATE_INITIALIZE:
                    {
                        if (1 == g_touch_tuning_phase_run)
                        {
                            g_touch_tuning_mode_save = g_touch_tuning_mode;
                            touch_tuning_initialize(p_instance_ctrl);
                            g_touch_tuning_phase_run = 0;
                            g_touch_tuning_state     = TOUCH_TUNING_STATE_SCAN;
                        }

                        break;
                    }

                    case TOUCH_TUNING_STATE_SCAN:
                    {
                        touch_tuning_dataget(p_instance_ctrl);
                        touch_tuning_scanstart(p_instance_ctrl);
                        break;
                    }

                    case TOUCH_TUNING_STATE_COMPLETE:
                    {
                        touch_tuning_qe_get_value(p_instance_ctrl);
                        g_touch_tuning_mode  = TOUCH_TUNING_MODE_QE_WATTING;
                        g_touch_tuning_state = TOUCH_TUNING_STATE_STOP;
                        break;
                    }

                    case TOUCH_TUNING_STATE_STOP:
                    {
                        break;
                    }
                }

                break;
            }

            case TOUCH_TUNING_MODE_MEASURE_PHASE2:
            {
                switch (g_touch_tuning_state)
                {
                    case TOUCH_TUNING_STATE_RESET:
                    {
                        break;
                    }

                    case TOUCH_TUNING_STATE_INITIALIZE:
                    {
                        if (1 == g_touch_tuning_phase_run)
                        {
                            g_touch_tuning_mode_save = g_touch_tuning_mode;
                            touch_tuning_initialize(p_instance_ctrl);
                            g_touch_tuning_phase_run = 0;
                            g_touch_tuning_state     = TOUCH_TUNING_STATE_SCAN;
                        }

                        break;
                    }

                    case TOUCH_TUNING_STATE_SCAN:
                    {
                        touch_tuning_dataget(p_instance_ctrl);
                        touch_tuning_scanstart(p_instance_ctrl);
                        break;
                    }

                    case TOUCH_TUNING_STATE_COMPLETE:
                    {
                        touch_tuning_qe_get_value(p_instance_ctrl);
                        g_touch_tuning_mode  = TOUCH_TUNING_MODE_QE_WATTING;
                        g_touch_tuning_state = TOUCH_TUNING_STATE_STOP;
                        break;
                    }

                    case TOUCH_TUNING_STATE_STOP:
                    {
                        break;
                    }
                }

                break;
            }

            case TOUCH_TUNING_MODE_MEASURE_PHASE3:
            {
                switch (g_touch_tuning_state)
                {
                    case TOUCH_TUNING_STATE_RESET:
                    {
                        break;
                    }

                    case TOUCH_TUNING_STATE_INITIALIZE:
                    {
                        if (1 == g_touch_tuning_phase_run)
                        {
                            g_touch_tuning_mode_save = g_touch_tuning_mode;
                            touch_tuning_initialize(p_instance_ctrl);
                            g_touch_tuning_phase_run = 0;
                            g_touch_tuning_state     = TOUCH_TUNING_STATE_SCAN;
                        }

                        break;
                    }

