xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
                    case TOUCH_TUNING_STATE_SCAN:
                    {
                        touch_tuning_dataget(p_instance_ctrl);
                        touch_tuning_scanstart(p_instance_ctrl);
                        break;
                    }

                    case TOUCH_TUNING_STATE_COMPLETE:
                    {
                        break;
                    }

                    case TOUCH_TUNING_STATE_STOP:
                    {
                        break;
                    }
                }

                break;
            }

            case TOUCH_TUNING_MODE_QE_WATTING:
            {
                break;
            }

            case TOUCH_TUNING_MODE_START:
            {
                p_instance_ctrl->p_ctsu_instance->p_api->scanStop(p_instance_ctrl->p_ctsu_instance->p_ctrl);

                g_touch_tuning_phase_run = 0;
                g_touch_tuning_mode      = TOUCH_TUNING_MODE_QE_WATTING;
                break;
            }

            case TOUCH_TUNING_MODE_FINISH:
            {
                g_touch_tuning_phase_run = 0;
                g_touch_tuning_mode      = TOUCH_TUNING_MODE_QE_WATTING;
                break;
            }
        }

        /* Reconnection due to UART baud rate difference. */
        touch_tuning_baudrate_err_reconnect ();
    }
}                                      /* End of function main() */

/***********************************************************************************************************************
 * touch_tuning_qe_get_value
 ***********************************************************************************************************************/
void touch_tuning_qe_get_value (touch_instance_ctrl_t * const p_instance_ctrl)
{
    uint16_t               i;
    uint16_t               num_elements;
    ctsu_instance_ctrl_t * p_ctsu_instance_ctrl = (ctsu_instance_ctrl_t *) p_instance_ctrl->p_ctsu_instance->p_ctrl;

    num_elements = p_ctsu_instance_ctrl->num_elements;
 #if (BSP_FEATURE_CTSU_VERSION == 1)
    if ((TOUCH_TUNING_SCAN_MUTUAL == g_touch_tuning_scan_mode) &&
        (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode))
    {
        num_elements = (uint16_t) (num_elements * 2);
    }
 #endif

    for (i = 0; i < num_elements; i++)
    {
 #if (BSP_FEATURE_CTSU_VERSION == 2)

        /* CTSU measurement condition data setting */
        g_touch_tuning_element_cfgs[i].so =
            p_ctsu_instance_ctrl->p_ctsuwr[i * CTSU_CFG_NUM_SUMULTI].ctsuso & TOUCH_UART_CTSUSO_MASK;
        g_touch_tuning_element_cfgs[i].snum =
            (p_ctsu_instance_ctrl->p_ctsuwr[i * CTSU_CFG_NUM_SUMULTI].ctsuso >> 10) & TOUCH_UART_CTSUSNUM_MASK;
        g_touch_tuning_element_cfgs[i].sdpa =
            (uint8_t) ((p_ctsu_instance_ctrl->p_ctsuwr[i * CTSU_CFG_NUM_SUMULTI].ctsuso >> 24) &
                       TOUCH_UART_CTSUSDPA_MASK);
 #endif
 #if (BSP_FEATURE_CTSU_VERSION == 1)
        g_touch_tuning_ctsu_write[i].ctsussc = p_ctsu_instance_ctrl->p_ctsuwr[i].ctsussc;
        g_touch_tuning_ctsu_write[i].ctsuso0 = p_ctsu_instance_ctrl->p_ctsuwr[i].ctsuso0;
        g_touch_tuning_ctsu_write[i].ctsuso1 = p_ctsu_instance_ctrl->p_ctsuwr[i].ctsuso1;
 #endif
    }
}

/***********************************************************************************************************************
 * touch_tuning_initialize
 ***********************************************************************************************************************/
void touch_tuning_initialize (touch_instance_ctrl_t * const p_instance_ctrl)
{
    uint16_t               i;
    ctsu_instance_ctrl_t * p_ctsu_instance_ctrl = (ctsu_instance_ctrl_t *) p_instance_ctrl->p_ctsu_instance->p_ctrl;

    /* Variable initialization processing */
    p_ctsu_instance_ctrl->wr_index = 0;
    p_ctsu_instance_ctrl->rd_index = 0;
    for (i = 0; i < TOUCH_TUNING_KEY_MAX_NUM; i++)
    {
        g_touch_tuning_ico_data[i] = 0;
    }

    p_ctsu_instance_ctrl->state = CTSU_STATE_IDLE;

    touch_tuning_scan_mode_select(p_instance_ctrl);
    touch_tuning_ts_setup(p_instance_ctrl);
    touch_tuning_qe_get_cfg(p_instance_ctrl);
    touch_tuning_scan_register_setting(p_instance_ctrl);
}

/***********************************************************************************************************************
 * touch_tuning_qe_get_cfg
 ***********************************************************************************************************************/
void touch_tuning_qe_get_cfg (touch_instance_ctrl_t * const p_instance_ctrl)
{
    uint16_t i;
    uint16_t num_elements;
 #if (BSP_FEATURE_CTSU_VERSION == 2)
    uint8_t loop;
 #endif
 #if (BSP_FEATURE_CTSU_VERSION == 1)
    uint16_t ctsu_sdpa;
 #endif
    ctsu_instance_ctrl_t * p_ctsu_instance_ctrl = (ctsu_instance_ctrl_t *) p_instance_ctrl->p_ctsu_instance->p_ctrl;

    p_ctsu_instance_ctrl->txvsel = (ctsu_txvsel_t) (g_touch_tuning_qe_txvsel & 0x01);
 #if (BSP_FEATURE_CTSU_VERSION == 2)
    p_ctsu_instance_ctrl->txvsel2 = (ctsu_txvsel2_t) ((g_touch_tuning_qe_txvsel >> 1) & 0x01);
 #endif
    num_elements = p_ctsu_instance_ctrl->num_elements;

 #if (BSP_FEATURE_CTSU_VERSION == 1)
    if ((TOUCH_TUNING_SCAN_MUTUAL == g_touch_tuning_scan_mode) &&
        (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode))
    {
        num_elements = (uint16_t) (num_elements * 2);
    }
 #endif

    for (i = 0; i < num_elements; i++)
    {
        if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode)
        {
 #if (BSP_FEATURE_CTSU_VERSION == 2)
            g_touch_tuning_element_cfgs[i].snum = 0x07;
            g_touch_tuning_element_cfgs[i].sdpa = 0x1F;
            g_touch_tuning_element_cfgs[i].so   = 0x00;
 #endif
 #if (BSP_FEATURE_CTSU_VERSION == 1)

            /* Get SDPA value */
            touch_tuning_pclkb_get(&g_touch_tuning_pclkb_frequency);
            ctsu_sdpa = (uint16_t) ((g_touch_tuning_pclkb_frequency / TOUCH_TUNING_PCLKB_FREQ_MHZ) - 1);

            /* CTSU measurement condition data setting */
            g_touch_tuning_ctsu_write[i].ctsussc = CTSU_SSDIV_0500 << 8;
            g_touch_tuning_ctsu_write[i].ctsuso0 = 0x0000;
            g_touch_tuning_ctsu_write[i].ctsuso1 =
                (uint16_t) ((TOUCH_TUNING_ICOG_RECOMMEND << 13) | (ctsu_sdpa << 8) | TOUCH_TUNING_RICOA_RECOMMEND);
 #endif
        }
        else if (TOUCH_TUNING_MODE_MEASURE_PHASE2 == g_touch_tuning_mode)
        {
            *(p_ctsu_instance_ctrl->p_element_complete_flag + i) = 0;
 #if (BSP_FEATURE_CTSU_VERSION == 2)
            *(p_ctsu_instance_ctrl->p_frequency_complete_flag + i) = 0;
 #endif
 #if (BSP_FEATURE_CTSU_VERSION == 1)
            *(p_ctsu_instance_ctrl->p_tuning_diff + i) = 0;
 #endif
 #if defined(CTSU_CFG_TARGET_VALUE_QE_SUPPORT)
            p_ctsu_instance_ctrl->tuning_self_target_value   = g_touch_tuning_self_target_value;
            p_ctsu_instance_ctrl->tuning_mutual_target_value = g_touch_tuning_mutual_target_value;
 #endif
        }
        else if (TOUCH_TUNING_MODE_MEASURE_PHASE3 == g_touch_tuning_mode)
        {
        }
        else
        {
        }

 #if (BSP_FEATURE_CTSU_VERSION == 2)
        for (loop = 0; loop < CTSU_CFG_NUM_SUMULTI; loop++)
        {
            p_ctsu_instance_ctrl->p_ctsuwr[i * CTSU_CFG_NUM_SUMULTI + loop].ctsuso =
                ((uint32_t) g_touch_tuning_element_cfgs[i].sdpa << 24) |
                ((uint32_t) g_touch_tuning_element_cfgs[i].snum << 10) |
                ((uint32_t) g_touch_tuning_element_cfgs[i].so);
        }
 #endif
 #if (BSP_FEATURE_CTSU_VERSION == 1)
        p_ctsu_instance_ctrl->p_ctsuwr[i].ctsussc = g_touch_tuning_ctsu_write[i].ctsussc;
        p_ctsu_instance_ctrl->p_ctsuwr[i].ctsuso0 = g_touch_tuning_ctsu_write[i].ctsuso0;
        p_ctsu_instance_ctrl->p_ctsuwr[i].ctsuso1 = g_touch_tuning_ctsu_write[i].ctsuso1 | TOUCH_TUNING_RICOA_RECOMMEND;
 #endif
    }

    /* Moving average reset */
    p_ctsu_instance_ctrl->average = 0;

