xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
    if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode)
    {
        p_ctsu_instance_ctrl->tuning = CTSU_TUNING_COMPLETE;
    }

    if (TOUCH_TUNING_MODE_MEASURE_PHASE2 == g_touch_tuning_mode)
    {
        p_ctsu_instance_ctrl->tuning = CTSU_TUNING_INCOMPLETE;
    }
}

/***********************************************************************************************************************
 * touch_tuning_scan_mode_select
 ***********************************************************************************************************************/
void touch_tuning_scan_mode_select (touch_instance_ctrl_t * const p_instance_ctrl)
{
    ctsu_instance_ctrl_t * p_ctsu_instance_ctrl = (ctsu_instance_ctrl_t *) p_instance_ctrl->p_ctsu_instance->p_ctrl;

    /* MD register */
    if (TOUCH_TUNING_SCAN_SELF == g_touch_tuning_scan_mode)
    {
        g_touch_tuning_md        = CTSU_MODE_SELF_MULTI_SCAN;
        p_ctsu_instance_ctrl->md = CTSU_MODE_SELF_MULTI_SCAN;

 #if (BSP_FEATURE_CTSU_VERSION == 1)
        if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode)
        {
            g_touch_tuning_qe_atune = CTSU_ATUNE1_HIGH;
        }
        else
        {
            g_touch_tuning_qe_atune = CTSU_ATUNE1_NORMAL;
        }
 #endif
    }
    else if (TOUCH_TUNING_SCAN_MUTUAL == g_touch_tuning_scan_mode)
    {
 #if (BSP_FEATURE_CTSU_VERSION == 1)
        g_touch_tuning_qe_atune = CTSU_ATUNE1_HIGH;
 #endif
        if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode)
        {
            g_touch_tuning_md        = CTSU_MODE_SELF_MULTI_SCAN;
            p_ctsu_instance_ctrl->md = CTSU_MODE_MUTUAL_FULL_SCAN;
 #if (BSP_FEATURE_CTSU_VERSION == 2)
  #if (CTSU_CFG_NUM_CFC != 0)
            R_CTSU->CTSUCRA_b.CSW = 1;
            R_CTSU->CTSUCRA_b.PON = 1;
            R_BSP_SoftwareDelay(30, BSP_DELAY_UNITS_MICROSECONDS);
  #endif
 #endif
        }
        else
        {
            g_touch_tuning_md        = CTSU_MODE_MUTUAL_FULL_SCAN;
            p_ctsu_instance_ctrl->md = CTSU_MODE_MUTUAL_FULL_SCAN;
        }
    }

 #if (BSP_FEATURE_CTSU_VERSION == 2)
    else                               /* CFC */
    {
        if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode)
        {
            g_touch_tuning_md        = CTSU_MODE_SELF_MULTI_SCAN;
            p_ctsu_instance_ctrl->md = CTSU_MODE_MUTUAL_FULL_SCAN;
        }
        else
        {
            g_touch_tuning_md        = CTSU_MODE_MUTUAL_CFC_SCAN;
            p_ctsu_instance_ctrl->md = CTSU_MODE_MUTUAL_CFC_SCAN;
        }
    }
 #else
    else
    {
    }
 #endif

    if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode)
    {
 #if (BSP_FEATURE_CTSU_VERSION == 2)
        g_touch_tuning_qe_atune = CTSU_ATUNE12_80UA;
 #endif
 #if (BSP_FEATURE_CTSU_VERSION == 1)
        g_touch_tuning_qe_atune = CTSU_ATUNE1_HIGH;
 #endif
    }

 #if (BSP_FEATURE_CTSU_VERSION == 2)
  #if (CTSU_CFG_NUM_CFC != 0)
    /* CFCON register */
    if ((TOUCH_TUNING_SCAN_MUTUAL_CFC == g_touch_tuning_scan_mode) &&
        (TOUCH_TUNING_MODE_MEASURE_PHASE1 != g_touch_tuning_mode))
    {
        R_CTSU->CTSUCALIB_b.CFCRDMD = 1;
        R_CTSU->CTSUCRA_b.CFCON     = 1;
    }
    else if ((TOUCH_TUNING_SCAN_MUTUAL_CFC == g_touch_tuning_scan_mode) &&
             (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode))
    {
        R_CTSU->CTSUCALIB_b.CFCRDMD = 0;
        R_CTSU->CTSUCRA_b.CFCON     = 0;
        R_CTSU->CTSUCRA_b.CSW       = 1;
        R_CTSU->CTSUCRA_b.PON       = 1;
        R_BSP_SoftwareDelay(30, BSP_DELAY_UNITS_MICROSECONDS);
    }
    else
    {
        R_CTSU->CTSUCALIB_b.CFCRDMD = 0;
        R_CTSU->CTSUCRA_b.CFCON     = 0;
    }
  #endif
 #endif
}

void touch_tuning_scan_register_setting (touch_instance_ctrl_t * const p_instance_ctrl)
{
    ctsu_instance_ctrl_t * p_ctsu_instance_ctrl = (ctsu_instance_ctrl_t *) p_instance_ctrl->p_ctsu_instance->p_ctrl;

    p_ctsu_instance_ctrl->ctsucr1  = (uint8_t) ((g_touch_tuning_qe_atune & 0x01) << 3);
    p_ctsu_instance_ctrl->ctsucr1 |= (uint8_t) (g_touch_tuning_md << 6);

 #if (BSP_FEATURE_CTSU_VERSION == 2)
    p_ctsu_instance_ctrl->ctsucr2  = (uint8_t) (g_touch_tuning_qe_atune & 0x02);
    p_ctsu_instance_ctrl->ctsucr2 |= (uint8_t) ((g_touch_tuning_md & 0x04) >> 2);
    p_ctsu_instance_ctrl->ctsucr2 |= (uint8_t) (g_touch_tuning_qe_posel << 4);

  #if (CTSU_CFG_MULTIPLE_ELECTRODE_CONNECTION_ENABLE == 1)
    p_ctsu_instance_ctrl->tsod          = g_touch_tuning_qe_tsod;
    p_ctsu_instance_ctrl->mec_ts        = g_touch_tuning_qe_mec_ts;
    p_ctsu_instance_ctrl->mec_shield_ts = g_touch_tuning_qe_mec_shield_ts;
  #endif
 #endif

 #if (BSP_FEATURE_CTSU_VERSION == 2)
    if (CTSU_ATUNE12_80UA == g_touch_tuning_qe_atune)
    {
        p_ctsu_instance_ctrl->range = CTSU_RANGE_80UA;
    }
    else if (CTSU_ATUNE12_40UA == g_touch_tuning_qe_atune)
    {
        p_ctsu_instance_ctrl->range = CTSU_RANGE_40UA;
    }
    else if (CTSU_ATUNE12_20UA == g_touch_tuning_qe_atune)
    {
        p_ctsu_instance_ctrl->range = CTSU_RANGE_20UA;
    }
    else if (CTSU_ATUNE12_160UA == g_touch_tuning_qe_atune)
    {
        p_ctsu_instance_ctrl->range = CTSU_RANGE_160UA;
    }
    else
    {
    }
 #endif
}

/***********************************************************************************************************************
 * touch_tuning_ts_setup
 ***********************************************************************************************************************/
void touch_tuning_ts_setup (touch_instance_ctrl_t * const p_instance_ctrl)
{
    ctsu_instance_ctrl_t * p_ctsu_instance_ctrl = (ctsu_instance_ctrl_t *) p_instance_ctrl->p_ctsu_instance->p_ctrl;
    uint32_t               element_maska;
    uint32_t               element_maskb;
    uint16_t               rx_element;
    uint16_t               tx_element;

    /* initialize variable*/
    p_ctsu_instance_ctrl->num_elements = 0;
    rx_element = 0;
    tx_element = 0;

    /* Count number of element */
    if (TOUCH_TUNING_SCAN_SELF == g_touch_tuning_scan_mode)
    {
        if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode)
        {
            g_touch_tuning_ts_chtrc_mask.mska = 0;
            g_touch_tuning_ts_chtrc_mask.mskb = 0;
        }
        else
        {
 #if (BSP_FEATURE_CTSU_VERSION == 1)
            g_touch_tuning_ts_chtrc_mask.mska = 0;
            g_touch_tuning_ts_chtrc_mask.mskb = 0;
 #endif
        }

        /* Excludes active shield from CHAC & CHACB */
        element_maska = g_touch_tuning_ts_chac_mask.mska - g_touch_tuning_ts_chtrc_mask.mska;
        element_maskb = g_touch_tuning_ts_chac_mask.mskb - g_touch_tuning_ts_chtrc_mask.mskb;

        /* Get the number of measurable elements */
        touch_tuning_count_element(element_maska, &p_ctsu_instance_ctrl->num_elements);
        touch_tuning_count_element(element_maskb, &p_ctsu_instance_ctrl->num_elements);

 #if (BSP_FEATURE_CTSU_VERSION == 2)
  #if (CTSU_CFG_MULTIPLE_ELECTRODE_CONNECTION_ENABLE == 1)
       if (1 == g_touch_tuning_qe_tsod)
       {
           p_ctsu_instance_ctrl->num_elements = 1;
       }
  #endif
 #endif

