xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
    }
    else if (TOUCH_TUNING_SCAN_MUTUAL == g_touch_tuning_scan_mode)
    {
        if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode)
        {
            /* Get the number of measurable elements */
            touch_tuning_count_element(g_touch_tuning_ts_chac_mask.mska, &p_ctsu_instance_ctrl->num_elements);
            touch_tuning_count_element(g_touch_tuning_ts_chac_mask.mskb, &p_ctsu_instance_ctrl->num_elements);

 #if (BSP_FEATURE_CTSU_VERSION == 1)
            if (0 == p_ctsu_instance_ctrl->num_elements % 2)
            {
                p_ctsu_instance_ctrl->num_elements = p_ctsu_instance_ctrl->num_elements / 2;
            }
            else
            {
                p_ctsu_instance_ctrl->num_elements = (uint16_t) (p_ctsu_instance_ctrl->num_elements / 2 + 1);
            }
 #endif

            g_touch_tuning_ts_chtrc_mask.mska = 0;
            g_touch_tuning_ts_chtrc_mask.mskb = 0;
        }
        else
        {
            /* Store rx element mask */
            element_maska = g_touch_tuning_ts_chac_mask.mska - g_touch_tuning_ts_chtrc_mask.mska;
            element_maskb = g_touch_tuning_ts_chac_mask.mskb - g_touch_tuning_ts_chtrc_mask.mskb;

            /* Get the number of measurable elements from enabled TS RX  */
            touch_tuning_count_element(element_maska, &rx_element);
            touch_tuning_count_element(element_maskb, &rx_element);

            /* Get the number of measurable elements from enabled TS TX  */
            touch_tuning_count_element(g_touch_tuning_ts_chtrc_mask.mska, &tx_element);
            touch_tuning_count_element(g_touch_tuning_ts_chtrc_mask.mskb, &tx_element);

            /* Get the number of measurable element (RX * TX)  */
            p_ctsu_instance_ctrl->num_elements = (uint16_t) (rx_element * tx_element);
        }
    }

 #if (BSP_FEATURE_CTSU_VERSION == 2)
  #if (CTSU_CFG_NUM_CFC != 0)
    else if (TOUCH_TUNING_SCAN_MUTUAL_CFC == g_touch_tuning_scan_mode)
    {
        if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode)
        {
            /* Get the number of measurable elements */
            touch_tuning_count_element(g_touch_tuning_ts_chtrc_mask.mska, &p_ctsu_instance_ctrl->num_elements);
            touch_tuning_count_element(g_touch_tuning_ts_chtrc_mask.mskb, &p_ctsu_instance_ctrl->num_elements);

            g_touch_tuning_ts_chac_mask.mska = g_touch_tuning_ts_chtrc_mask.mska;
            g_touch_tuning_ts_chac_mask.mskb = g_touch_tuning_ts_chtrc_mask.mskb;

            g_touch_tuning_ts_chtrc_mask.mska = 0;
            g_touch_tuning_ts_chtrc_mask.mskb = 0;
        }
        else
        {
            /* Store rx element mask */
            element_maska = g_touch_tuning_ts_chac_mask.mska - g_touch_tuning_ts_chtrc_mask.mska;
            element_maskb = g_touch_tuning_ts_chac_mask.mskb - g_touch_tuning_ts_chtrc_mask.mskb;

            /* Get the number of measurable elements from enabled TS RX  */
            touch_tuning_count_element(element_maska, &rx_element);
            touch_tuning_count_element(element_maskb, &rx_element);

            /* Get the number of measurable elements from enabled TS TX  */
            touch_tuning_count_element(g_touch_tuning_ts_chtrc_mask.mska, &tx_element);
            touch_tuning_count_element(g_touch_tuning_ts_chtrc_mask.mskb, &tx_element);

            /* Get the number of measurable element (RX * TX)  */
            p_ctsu_instance_ctrl->num_elements = (uint16_t) (rx_element * tx_element);
        }
    }
  #endif
 #endif
    else
    {
    }

    /* get chac  */
    p_ctsu_instance_ctrl->ctsuchac0 = (uint8_t) (g_touch_tuning_ts_chac_mask.mska & TOUCH_UART_TSCHAC_MASK);
    p_ctsu_instance_ctrl->ctsuchac1 = (uint8_t) ((g_touch_tuning_ts_chac_mask.mska >> 8) & TOUCH_UART_TSCHAC_MASK);
    p_ctsu_instance_ctrl->ctsuchac2 = (uint8_t) ((g_touch_tuning_ts_chac_mask.mska >> 16) & TOUCH_UART_TSCHAC_MASK);
    p_ctsu_instance_ctrl->ctsuchac3 = (uint8_t) ((g_touch_tuning_ts_chac_mask.mska >> 24) & TOUCH_UART_TSCHAC_MASK);
    p_ctsu_instance_ctrl->ctsuchac4 = (uint8_t) (g_touch_tuning_ts_chac_mask.mskb & TOUCH_UART_TSCHAC_MASK);

    /* get chtrc  */
    p_ctsu_instance_ctrl->ctsuchtrc0 = (uint8_t) (g_touch_tuning_ts_chtrc_mask.mska & TOUCH_UART_TSCHTRC_MASK);
    p_ctsu_instance_ctrl->ctsuchtrc1 = (uint8_t) ((g_touch_tuning_ts_chtrc_mask.mska >> 8) & TOUCH_UART_TSCHTRC_MASK);
    p_ctsu_instance_ctrl->ctsuchtrc2 = (uint8_t) ((g_touch_tuning_ts_chtrc_mask.mska >> 16) & TOUCH_UART_TSCHTRC_MASK);
    p_ctsu_instance_ctrl->ctsuchtrc3 = (uint8_t) ((g_touch_tuning_ts_chtrc_mask.mska >> 24) & TOUCH_UART_TSCHTRC_MASK);
    p_ctsu_instance_ctrl->ctsuchtrc4 = (uint8_t) (g_touch_tuning_ts_chtrc_mask.mskb & TOUCH_UART_TSCHTRC_MASK);
}

void touch_tuning_count_element (uint32_t element_mask, uint16_t * num_element)
{
    uint8_t n;

    /* Get the number of measurable elements from enabled CHAC or CHTRC  */
    for (n = 0; n < TOUCH_TUNING_CH_REG_MAX_NUM; n++)
    {
        if (0x00000001 == ((element_mask >> n) & 0x00000001))
        {
            (*num_element)++;
        }
    }
}

void touch_tuning_uart_connect (void)
{
    volatile sci_err_t err;
    g_touch_uart_config.async.baud_rate    = TOUCH_CFG_UART_BAUDRATE;
    g_touch_uart_config.async.clk_src      = SCI_CLK_INT;
    g_touch_uart_config.async.data_size    = SCI_DATA_8BIT;
    g_touch_uart_config.async.parity_en    = SCI_PARITY_OFF;
    g_touch_uart_config.async.parity_type  = SCI_EVEN_PARITY;
    g_touch_uart_config.async.stop_bits    = SCI_STOPBITS_1;
    g_touch_uart_config.async.int_priority = TOUCH_CFG_UART_PRIORITY;

    err = R_SCI_Open(TOUCH_CFG_UART_NUMBER, SCI_MODE_ASYNC, &g_touch_uart_config, touch_uart_callback, &g_touch_uart_control);

    err = R_SCI_Receive(g_touch_uart_control, &g_touch_uart_rx_buf[0] ,TOUCH_TUNING_RECIEVE_BUF_SIZE);

    return;
}

void touch_tuning_open (touch_instance_ctrl_t * const p_instance_ctrl)
{
    ctsu_instance_ctrl_t * p_ctsu_instance_ctrl = (ctsu_instance_ctrl_t *) p_instance_ctrl->p_ctsu_instance->p_ctrl;
 #if (CTSU_CFG_NUM_SELF_ELEMENTS != 0)
    if (p_ctsu_instance_ctrl->md == CTSU_MODE_SELF_MULTI_SCAN)
    {
        p_ctsu_instance_ctrl->p_self_raw =
            (p_ctsu_instance_ctrl->p_self_raw -
             ((p_ctsu_instance_ctrl->self_elem_index - p_ctsu_instance_ctrl->num_elements) * CTSU_CFG_NUM_SUMULTI));
        p_ctsu_instance_ctrl->p_self_data =
            (p_ctsu_instance_ctrl->p_self_data -
             ((p_ctsu_instance_ctrl->self_elem_index - p_ctsu_instance_ctrl->num_elements)));
        p_ctsu_instance_ctrl->p_self_corr =
            (p_ctsu_instance_ctrl->p_self_corr -
             ((p_ctsu_instance_ctrl->self_elem_index - p_ctsu_instance_ctrl->num_elements) * CTSU_CFG_NUM_SUMULTI));
#if (BSP_FEATURE_CTSU_VERSION == 2)
        p_ctsu_instance_ctrl->p_selected_freq_self =
        	(p_ctsu_instance_ctrl->p_selected_freq_self -
        	 ((p_ctsu_instance_ctrl->ctsu_elem_index - p_ctsu_instance_ctrl->num_elements)));
#endif
    }
 #endif

 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
    if (p_ctsu_instance_ctrl->md == CTSU_MODE_MUTUAL_FULL_SCAN)
    {
        p_ctsu_instance_ctrl->p_mutual_raw =
            (p_ctsu_instance_ctrl->p_mutual_raw -
             ((p_ctsu_instance_ctrl->mutual_elem_index - p_ctsu_instance_ctrl->num_elements) * CTSU_CFG_NUM_SUMULTI *
              2));
        p_ctsu_instance_ctrl->p_mutual_pri_corr =
            (p_ctsu_instance_ctrl->p_mutual_pri_corr -
             ((p_ctsu_instance_ctrl->mutual_elem_index - p_ctsu_instance_ctrl->num_elements) * CTSU_CFG_NUM_SUMULTI));
        p_ctsu_instance_ctrl->p_mutual_snd_corr =
            (p_ctsu_instance_ctrl->p_mutual_snd_corr -
             ((p_ctsu_instance_ctrl->mutual_elem_index - p_ctsu_instance_ctrl->num_elements) * CTSU_CFG_NUM_SUMULTI));
        p_ctsu_instance_ctrl->p_mutual_pri_data =
            (p_ctsu_instance_ctrl->p_mutual_pri_data -
             ((p_ctsu_instance_ctrl->mutual_elem_index - p_ctsu_instance_ctrl->num_elements)));
        p_ctsu_instance_ctrl->p_mutual_snd_data =
            (p_ctsu_instance_ctrl->p_mutual_snd_data -
             ((p_ctsu_instance_ctrl->mutual_elem_index - p_ctsu_instance_ctrl->num_elements)));
#if (BSP_FEATURE_CTSU_VERSION == 2)
        p_ctsu_instance_ctrl->p_selected_freq_mutual =
        	(p_ctsu_instance_ctrl->p_selected_freq_mutual -
        	 ((p_ctsu_instance_ctrl->ctsu_elem_index - p_ctsu_instance_ctrl->num_elements)));
#endif

