xlloss/RX140_64_KIT/src/smc_gen/rm_touch_qe/src/rm_touch_qe.c
    }
 #endif
    p_ctsu_instance_ctrl->p_element_complete_flag =
        (p_ctsu_instance_ctrl->p_element_complete_flag -
         (p_ctsu_instance_ctrl->ctsu_elem_index - p_ctsu_instance_ctrl->num_elements));
 #if (BSP_FEATURE_CTSU_VERSION == 2)
    p_ctsu_instance_ctrl->p_frequency_complete_flag =
        (p_ctsu_instance_ctrl->p_frequency_complete_flag -
         (p_ctsu_instance_ctrl->ctsu_elem_index - p_ctsu_instance_ctrl->num_elements));
 #endif
    p_ctsu_instance_ctrl->p_tuning_diff =
        (p_ctsu_instance_ctrl->p_tuning_diff -
         (p_ctsu_instance_ctrl->ctsu_elem_index - p_ctsu_instance_ctrl->num_elements));
    p_ctsu_instance_ctrl->p_ctsuwr =
        (p_ctsu_instance_ctrl->p_ctsuwr -
         ((p_ctsu_instance_ctrl->ctsu_elem_index - p_ctsu_instance_ctrl->num_elements) * CTSU_CFG_NUM_SUMULTI));
}

void touch_tuning_dataget (touch_instance_ctrl_t * const p_instance_ctrl)
{
    uint16_t               i;
    ctsu_instance_ctrl_t * p_ctsu_instance_ctrl = (ctsu_instance_ctrl_t *) p_instance_ctrl->p_ctsu_instance->p_ctrl;

    if (CTSU_STATE_SCANNED == p_ctsu_instance_ctrl->state)
    {
        p_instance_ctrl->p_ctsu_instance->p_api->dataGet(p_instance_ctrl->p_ctsu_instance->p_ctrl,
                                                         &g_touch_tuning_ico_data[0]);

        g_touch_tuning_err_event = p_ctsu_instance_ctrl->error_status;
        if (TOUCH_TUNING_MODE_MEASURE_PHASE3 != g_touch_tuning_mode)
        {
            g_touch_tuning_state = TOUCH_TUNING_STATE_COMPLETE;
        }

        if (TOUCH_TUNING_MODE_MEASURE_PHASE1 == g_touch_tuning_mode)
        {
            for (i = 0; i < p_ctsu_instance_ctrl->num_elements; i++)
            {
                if (TOUCH_TUNING_SCAN_SELF == g_touch_tuning_scan_mode)
                {
                    g_touch_tuning_ico_data[i] = p_ctsu_instance_ctrl->p_self_corr[i * CTSU_CFG_NUM_SUMULTI];
                }
                else if (TOUCH_TUNING_SCAN_MUTUAL == g_touch_tuning_scan_mode)
                {
                    g_touch_tuning_ico_data[i * 2]     = p_ctsu_instance_ctrl->p_mutual_pri_corr[i];
                    g_touch_tuning_ico_data[i * 2 + 1] = p_ctsu_instance_ctrl->p_mutual_snd_corr[i];
                }

 #if (BSP_FEATURE_CTSU_VERSION == 2)
  #if (CTSU_CFG_NUM_CFC != 0)
                else if (TOUCH_TUNING_SCAN_MUTUAL_CFC == g_touch_tuning_scan_mode)
                {
                    g_touch_tuning_ico_data[i] = p_ctsu_instance_ctrl->p_mutual_raw[i];
                }
  #endif
 #endif
                else
                {
                }
            }
        }
        else if (TOUCH_TUNING_MODE_MEASURE_PHASE2 == g_touch_tuning_mode)
        {
            if (p_ctsu_instance_ctrl->tuning == CTSU_TUNING_INCOMPLETE)
            {
                g_touch_tuning_state = TOUCH_TUNING_STATE_SCAN;
            }
        }
        else if (TOUCH_TUNING_MODE_MEASURE_PHASE3 == g_touch_tuning_mode)
        {
 #if (CTSU_CFG_NUM_MUTUAL_ELEMENTS != 0)
            if (TOUCH_TUNING_SCAN_MUTUAL == g_touch_tuning_scan_mode)
            {
                for (i = 0; i < CTSU_CFG_NUM_MUTUAL_ELEMENTS; i++)
                {
                    g_touch_tuning_mutual_data[i] =
                        (uint16_t) (g_touch_tuning_ico_data[i * 2 + 1] - g_touch_tuning_ico_data[i * 2]);
                }
            }

  #if (BSP_FEATURE_CTSU_VERSION == 2)
   #if (CTSU_CFG_NUM_CFC != 0)
            else if (TOUCH_TUNING_SCAN_MUTUAL_CFC == g_touch_tuning_scan_mode)
            {
                for (i = 0; i < CTSU_CFG_NUM_MUTUAL_ELEMENTS; i++)
                {
                    g_touch_tuning_mutual_data[i] =
                        (uint16_t) (g_touch_tuning_ico_data[i * 2 + 1] - g_touch_tuning_ico_data[i * 2]);
                }
            }
   #endif
  #endif
            else
            {
            }
 #endif
        }
        else
        {
        }
    }
}

void touch_tuning_scanstart (touch_instance_ctrl_t * const p_instance_ctrl)
{
    ctsu_instance_ctrl_t * p_ctsu_instance_ctrl = (ctsu_instance_ctrl_t *) p_instance_ctrl->p_ctsu_instance->p_ctrl;

    if ((CTSU_STATE_IDLE == p_ctsu_instance_ctrl->state) && (TOUCH_TUNING_STATE_COMPLETE != g_touch_tuning_state))
    {
        /* CTSU measurement start processing */
        p_instance_ctrl->p_ctsu_instance->p_api->scanStart(p_instance_ctrl->p_ctsu_instance->p_ctrl);
    }
}

void touch_tuning_get32 (uint32_t * p_val, uint16_t index)
{
    *p_val = ((uint32_t) g_touch_uart_rx_buf[index + 3] << 24) |
             ((uint32_t) g_touch_uart_rx_buf[index + 2] << 16) |
             ((uint32_t) g_touch_uart_rx_buf[index + 1] << 8) |
             ((uint32_t) g_touch_uart_rx_buf[index]);
}

void touch_tuning_get16 (uint16_t * p_val, uint16_t index)
{
    *p_val = (uint16_t) ((g_touch_uart_rx_buf[index + 1] << 8) |
                         g_touch_uart_rx_buf[index]);
}

void touch_tuning_get8 (uint8_t * p_val, uint16_t index)
{
    *p_val = (g_touch_uart_rx_buf[index]);
}

void touch_tuning_send32 (uint32_t value, uint16_t index)
{
    g_touch_tuning_tx_buf[index]     = (uint8_t) (value);
    g_touch_tuning_tx_buf[index + 1] = (uint8_t) (value >> 8);
    g_touch_tuning_tx_buf[index + 2] = (uint8_t) (value >> 16);
    g_touch_tuning_tx_buf[index + 3] = (uint8_t) (value >> 24);
}

void touch_tuning_send16 (uint16_t value, uint16_t index)
{
    g_touch_tuning_tx_buf[index]     = (uint8_t) (value);
    g_touch_tuning_tx_buf[index + 1] = (uint8_t) (value >> 8);
    g_touch_tuning_tx_buf[index + 2] = 0;
    g_touch_tuning_tx_buf[index + 3] = 0;
}

void touch_tuning_send8 (uint8_t value, uint16_t index)
{
    g_touch_tuning_tx_buf[index]     = (value);
    g_touch_tuning_tx_buf[index + 1] = 0;
    g_touch_tuning_tx_buf[index + 2] = 0;
    g_touch_tuning_tx_buf[index + 3] = 0;
}

 #if (BSP_FEATURE_CTSU_VERSION == 1)
void touch_tuning_pclkb_get (volatile uint32_t * pclkb_frequency)
{
    if (TOUCH_TUNING_PCLKB_FREQ_32MHZ >= *pclkb_frequency)
    {
    }
    else if ((TOUCH_TUNING_PCLKB_FREQ_32MHZ < *pclkb_frequency) && (TOUCH_TUNING_PCLKB_FREQ_64MHZ >= *pclkb_frequency))
    {
        *pclkb_frequency = (uint32_t) (*pclkb_frequency / 2);
    }
    else
    {
        *pclkb_frequency = (uint32_t) (*pclkb_frequency / 4);
    }
}

 #endif

/* Reconnection due to UART baud rate difference. */
void touch_tuning_baudrate_err_reconnect (void)
{
    if (1 == g_touch_uart_baudrate_err_flag)
    {
        g_touch_uart_baudrate_err_flag = 0;
        R_BSP_SoftwareDelay(10, BSP_DELAY_MILLISECS);
        g_receive_intterupt_count = 0;
        R_SCI_Close(g_touch_uart_control);
        R_SCI_Open(TOUCH_CFG_UART_NUMBER, SCI_MODE_ASYNC, &g_touch_uart_config, touch_uart_callback, &g_touch_uart_control);
    }
}

#endif
